<template>
<CpnavbarVue title="就诊建议"/>
    <div style="background: #E8E8E8;height:100%;">
		<div style="padding: 10px;">就诊建议</div>
		<div style="background: white;">
			<p style="padding: 10px;">{{mess}}</p>
		</div>
		<div style="margin: 10px;">推荐科室</div>
		<div style="background: white;">
			<div style="padding: 10px;">{{deptName}}</div>
			<div style="padding-left: 10px;padding-right: 10px;padding-bottom: 10px;">
				<button id="order" style="color: #007AFC;border-color: #007AFC;border-radius:30px ;" @click="order">预约挂号</button>
			</div>
		</div>
		<div>
			<div>
				<p style="margin: 15px;"><span style="color: #007AFC;">温馨提示: </span>以上推荐科室仅供参考</p>
			</div>
		</div>
    </div>
</template>
<script>
import CpnavbarVue from '../../components/Cpnavbar.vue';
export default {
    components:{CpnavbarVue},
    data(){
        return{
          mess:'暂无',
          deptName:''
        }
    },
    mounted(){
        const {y, i, isSex, isAge, index}=this.$route.query; //5 4 1 1 2
        if(y == 1) {
			//头部
			if(i == 0) {
				//腮腺肿大 
				if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="细菌性腮腺炎，需立即前往医院就诊"
                    this.deptName='口腔科'
				} else if(index == 2) {
					//第二题
                    this.mess="流行性腮腺炎，需前往医院就诊，并进行隔离"
                    this.deptName='口腔科'
				} else if(index == 3) {
					//第第三题
                    this.mess="腮腺肿瘤，需立即前往医院检查，根据医生建议进行治疗"
                    this.deptName='耳鼻咽喉科'
				}
			} 
            else if(i == 1) {
				//头晕		
                if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="偏头痛，需前往医院检查"
                    this.deptName='神经科内科'
				} else if(index == 2) {
					//第二题
                    this.mess="营养不良或贫血，造成"
                    this.deptName='血液科'
				} else if(index == 3) {
					//第第三题
                    this.mess="外伤性头痛，需要前往医院就诊或休息"
                    this.deptName='神经外科'
				}
			} 
            else if(i == 2) {
				//耳痛
                if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="中耳炎，需前往医院就诊"
                    this.deptName='耳鼻喉科'
				} else if(index == 2) {
					//第二题
                    this.mess="急性牙髓炎,口服药物卡马西平，如果效果不好可以考虑手术,"
                    this.deptName='口腔科'
				} else if(index == 3) {
					//第第三题
                    this.mess="外耳炎症,因游泳时耳朵进水，不洁掏耳，耳道内滋生细菌引起,建议在游泳时佩戴游泳耳塞，游泳后及时擦干，保持耳朵干燥；建议及时看医生。"
                    this.deptName='耳鼻喉科'
				} else if(index == 4) {
					//第第三题
                    this.mess="黄耳伤寒,需前往医院就诊，治不及时，可危及生命"
                    this.deptName='耳鼻喉科'
				} else if(index == 5) {
					//第第三题
                    this.mess="耳溢液，有警示症状者应立即就医。无警示体征的人应尽快去看医生，并在接受评估之前避免耳朵与水接触。"
                    this.deptName='耳鼻喉科'
				}				
			}
            else if(i == 3) {
				//语言障碍		
                if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="先天性语言障碍症";
                    this.deptName='神经科';
				}else if(index==2){
                    this.mess="发育性语言障碍,由于发育延迟而引起的语言障碍";
                    this.deptName="结合儿科、耳鼻喉科等检查结果做出诊断、评估和干预"
                }	
			} 
            else if(i == 4) {
				//头痛		
                if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="偏头痛，需要前往医院就诊";
                    this.deptName='神经科';
				}else if(index==2){
                    this.mess="感冒引起的头痛，可前往医院就诊";
                    this.deptName="耳鼻喉科"
                }else if(index==3){
                    this.mess="头部创伤,应尽快前往医院接收进一步检查";
                    this.deptName="神经科"
                }else if(index==4){
                    this.mess="三叉神经痛,对于疼痛相对较轻的患者我们首先应用药物治疗，当药物治疗无效时才考虑手术治疗。";
                    this.deptName="神经科"
                }else if(index==5){
                    this.mess="偏头痛，需要前往医院就诊";
                    this.deptName="神经科"
                }else if(index=6){
                    this.mess="自发性脑出血,需前往医院就诊";
                    this.deptName="神经科"
                }else if(index==7){
                    this.mess="颈椎病,请前往医院就诊";
                    this.deptName="骨科"
                }else if(index==8){
                    this.mess="鼻窦炎，需立即药物治疗或前往医院就诊";
                    this.deptName="耳鼻喉科"
                }else if(index==9){
                    this.mess="良性发作性位置性眩晕,前往医院就诊";
                    this.deptName="耳鼻喉科"
                }else if(index==10){
                    this.mess="慢性每日头痛,前往医院jiuzh";
                    this.deptName="神经科"
                }
			} 
            else if(i == 5) {
				//面部疼痛
                if(index == 1) {
					//第一题
					//业务逻辑，显示具体的推荐信息
                    this.mess="疱疹样皮炎,需要前往医院就诊";
                    this.deptName='皮肤科';
				}else if(index==2){
                    this.mess="三叉神经痛,对于疼痛相对较轻的患者我们首先应用药物治疗，当药物治疗无效时才考虑手术治疗。";
                    this.deptName="神经科"
                }				
			}

		} 
        else if(y == 2) {
			//颈部
			if(i == 0) {
				//甲状腺肿大
                if(index==1){
                    this.mess="甲状腺囊肿，前往医院就诊";
                    this.deptName='内分泌科、外科';
                }else if(index==2){
                    this.mess="甲状腺结节,需前往医院检查";
                    this.deptName='内分泌科';
                }else if(index==3){
                    this.mess="甲状腺结节,需前往医院检查";
                    this.deptName='内分泌科';
                }else if(index==4){
                    this.mess="甲亢，需前往医院进行检查，并进行相应的就诊";
                    this.deptName='内分泌科';
                }else if(index==5){
                    this.mess="甲状腺结节,需前往医院检查";
                    this.deptName='内分泌科';
                }else if(index==6){
                    this.mess="甲状腺结节,需前往医院检查";
                    this.deptName='内分泌科';
                }
			} else if(i == 1) {
				//吞咽苦难	
                if(index==1){
                    this.mess="感冒或流感,病毒引起的咽喉疼痛可自行缓解。 链球菌性咽喉炎是一种由细菌引起的不常见的咽喉疼痛，需要使用抗生素治疗";
                    this.deptName='耳鼻喉科';
                }else if(index==2){
                    this.mess="肋软骨炎,找个玻璃瓶,装满热水,拧紧盖子,放在痛点处,水温尽可能高,以能承受为宜。刚开始烫的话，可以隔一层秋衣,来回滚动,不烫了以后,就贴着痛点保持不动即可。一次15分钟,一天3次,1天可缓解,2-3天可痊愈。";
                    this.deptName='骨科、胸外科';
                }else if(index==3){
                    this.mess="吞咽困难,请咨询医务人员";
                    this.deptName='耳鼻喉科';
                }
			} else if(i == 2) {
				//咽喉疼痛	
                if(index==1){
                    this.mess="流行性感冒，大多数流感患者均可在家中自行治疗，而且通常不需要就诊。如果您出现流感症状并有并发症的风险，请立即就诊";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="颈深部感染,需前往医院就诊";
                    this.deptName='';
                }else if(index==3){
                    this.mess="化脓性腮腺炎,需前往医院就诊";
                    this.deptName='口腔科';
                }else if(index==4){
                    this.mess="喉癌,需立即前往医院检查，根据检查结果进行就诊";
                    this.deptName='耳鼻喉科';
                }else if(index==5){
                    this.mess="喉炎,最好是上医院请专科医生详细检查，诊断后再对症治疗";
                    this.deptName='耳鼻喉科、口腔科';
                }else if(index==6){
                    this.mess="慢性咽炎,应该多喝水，减少进食刺激性的食物，减少饮浓咖啡、浓茶等";
                    this.deptName='耳鼻喉科';
                }		
			} else if(i == 3) {
				//颈部疼痛或僵硬
                if(index==1){
                    this.mess="落枕，建议中医推拿疗法";
                    this.deptName='骨科、针灸推拿科';
                }else if(index==2){
                    this.mess="偏头痛，需前往医院检查"
                    this.deptName='神经科内科'
                }else if(index==3){
                    this.mess="颈椎病,请前往医院就诊";
                    this.deptName="骨科"
                }else if(index==4){
                    this.mess="颈椎疼痛，如果颈部疼痛并伴有手臂或手麻木或虚弱无力，或者肩膀或手臂出现阵痛，请就医";
                    this.deptName='骨科';
                }		
			}
		} 
        else if(y == 3) {
			//胸部
			if(isSex==2 && isAge==1){
              if(i == 0) {
				//咳痰
                if(index==1){
                    this.mess="支气管哮喘,应该积极地治疗，争取完全控制症状";
                    this.deptName='儿科、呼吸内科';
                }else if(index==2){
                    this.mess="肺结核，及时到当地结核病定点医疗机构就诊";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="慢性阻塞性肺病，可以通过不吸烟，避免空气污染和接种疫苗来改善症状。可以通过药物、氧气和肺部康复进行治疗";
                    this.deptName='呼吸内科';
                }	
			}else if(i==1){
               //乳房肿块
               if(index==1){
                    this.mess="乳房出现肿块也可能与荷尔蒙分泌失调、乳房导管炎或其他乳腺疾病有关，需前往医院就诊，医生会进行综合评估，确定最佳的处理方案，确诊肿块是否为恶性病变，并及时予以治疗。";
                    this.deptName='妇科';
                }else if(index==2){
                    this.mess="分泌物出现的原因可能是乳头炎、乳腺导管扩张、乳管内乳头瘤、良性肿瘤或其他疾病，需要进一步评估以确定病因。医生会进行乳房体格检查、医史询问，可能会建议进行乳腺超声检查、乳腺彩超、乳腺核磁共振等检查，以便了解导致分泌物的原因并确定相应的治疗策略。在治疗期间，医生可能会对您的情况进行随访，并建议您进行必要的检查和随访，以确保症状得到控制，并且预防长期复发。";
                    this.deptName='妇科';
                }
            }else if(i == 2) {
				//肩部疼痛
                if(index==1){
                    this.mess="心绞痛，需前往医院检查，医务人员会进行体格检查，并询问相关症状";
                    this.deptName='心血管内科';
                }else if(index==2){
                    this.mess="肩袖损伤,有肩部外伤史、50岁以上中老年人出现上述肩部症状时，应去医院就诊，排查是否肩袖损伤。轻度肩袖损伤可以采取保守治疗，让肩关节得到充分的休息，在医生指导下服用消炎、止痛药物，中医中药及功能康复锻炼，对肩袖损伤也有一定效果；严重肩袖损伤撕裂需要手术治疗。";
                    this.deptName='';
                }else if(index==3){
                    this.mess="肩袖损伤,有肩部外伤史、50岁以上中老年人出现上述肩部症状时，应去医院就诊，排查是否肩袖损伤。轻度肩袖损伤可以采取保守治疗，让肩关节得到充分的休息，在医生指导下服用消炎、止痛药物，中医中药及功能康复锻炼，对肩袖损伤也有一定效果；严重肩袖损伤撕裂需要手术治疗。";
                    this.deptName='骨科';
                }else if(index==4){
                    this.mess="肩周炎，以进行一些简单的治疗。比如，服用减轻疼痛和肿胀的药物，这些药物包括非甾体抗炎药，如布洛芬等；如果疼痛和肿胀很严重，可以通过肩关节注射皮质类固醇来减轻症状，短期的应用小剂量的激素不会造成不良反应；由康复师指导做拉伸和运动范围练习，可以去医院也可以在家进行这方面的锻炼。";
                    this.deptName='骨科';
                }else if(index==5){
                    this.mess="颈部疼痛，减少活动，卧床休息，也可佩戴颈托限制颈部活动。其次，使用非甾体类消炎镇痛药物以及肌肉松弛剂。同时，也可选择外用乳膏类药物、膏药、热敷等作为辅助治疗。";
                    this.deptName='骨科，神经科，复健科';
                }	
			}else if(i == 3) {
				//喘鸣	
                if(index==1){
                    this.mess="哮喘，需及时去医院就医";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="支气管炎，患者常常需要补充液体和应用退热药物。可适当应用镇咳药物。痰量较多或较黏时，可应用祛痰剂。";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="呼吸困难，需前往医院就诊";
                    this.deptName='心脏科';
                }	
			}else if(i==4){
               //乳房疼痛
               if(index==1){
                    this.mess="能需要进行超声检查或乳腺X线摄影。但也需要注意的是，怀孕期间乳房增大和变化也是正常的生理现象，有时候乳房疼痛可能只是因为这个原因引起的，不一定是病理性的问题。";
                    this.deptName='妇科';
                }else if(index==2){
                    this.mess="可能是该药物的副作用之一。医生可以评估您的特殊病历和用药情况，确定您正在服用的药物类型、剂量等信息，会考虑调整药物的剂量或者换用其他的药物。若乳房疼痛的原因需要进一步检查，医生也会进行乳房体格检查，并建议其他必要的检查，以确诊并选择最佳的治疗方案。";
                    this.deptName='内科';
                }else if(index==3){
                    this.mess="乳房疼痛和咳嗽可能存在关联，许多肺部感染或炎症等疾病也可能导致乳房疼痛。医生可能要检查您的呼吸系统来确定您的症状是由肺部问题引起的还是其他潜在健康问题。此外，干呕、恶心和干咳也可能是消化系统或其他健康问题导致的，医生可能会进一步诊断您的身体状况以确定最适当的治疗方法。";
                    this.deptName='呼吸科';
                }else if(index==4){
                    this.mess="些症状可能涉及到呼吸道感染或炎症，例如： 肺炎、扁桃体炎、喉炎等。 医生会对您的症状进行必要的检查和诊断，可能会进行喉咙的检查和听诊，检查您的呼吸状况，也可能会检查乳腺是否有其他的异常表现，确定引起疼痛的原因。医生会根据诊断结果给予合适的治疗方案。";
                    this.deptName='耳鼻喉科';
                }else if(index==5){
                    this.mess="需要前往医院就诊，医生需要对您的呼吸系统进行仔细的检查，以确定可能存在的任何问题，包括可能的哮喘、支气管炎和肺部感染等。医生可能会进行肺功能测试、胸部X光和其他必要的检查来判断疼痛和呼吸问题的关联，从而确定最佳的治疗方法。";
                    this.deptName='呼吸科';
                }else if(index==6){
                    this.mess="这些症状可能是肺部疾病或其他严重疾病的迹象，需要前往医院就诊，进行肺功能测试、胸部X光等检查来予以诊断和治疗，医生会根据病情判断是否需要进行其他影像学和实验室检查。";
                    this.deptName='急诊科';
                }	
            }else if(i == 5) {
				//咳嗽		
                if(index==1){
                    this.mess="过敏性咳嗽，去除病因，控制发作和预防复发，可通过寻找过敏源的方法找出过敏源而进行脱敏解决。此外受遗传和环境双重因素影响，应避免接触过敏原，积极避免清除感染病灶，去除各种诱发因素，如吸烟，油漆，冰冷饮料，气候突变等";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="药源性咳嗽,需前往医院检查";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="急性咽炎，可使用连花清瘟（颗粒或胶囊），以及一些辨证的汤剂，避免滥用抗生素。";
                    this.deptName='耳鼻喉科';
                }else if(index==4){
                    this.mess="咽炎，以缓解症状为主，如果有鼻咽部疾病的，要及时治疗疾病；病因不明确的，医生可能会推荐使用一些对症药物来缓解症状。此外，还有一些物理治疗，可能有一定效果。";
                    this.deptName='耳鼻咽喉科、呼吸内科';
                }else if(index==5){

                    this.mess="支气管炎，需要补充液体和应用退热药物。可适当应用镇咳药物。痰量较多或较黏时，可应用祛痰剂。";
                    this.deptName='呼吸内科';
                }else if(index==6){
                    this.mess="肺炎,应根据病菌种类及药敏结果选择用药。如有缺氧等症状给予吸氧和对症处理。防治并发症。加患者的护理工作，饮食宜清淡，易消化。";
                    this.deptName='呼吸内科';
                }
			} 
            else if(i == 6) {
				//心悸	
                if(index==1){
                    this.mess="心律不齐，适时向医生进行咨询";
                    this.deptName='心血管内科，心脏科';
                }else if(index==2){
                    this.mess="心力衰竭，需前往医院就诊";
                    this.deptName='心血管内科、内科';
                }else if(index==3){
                    this.mess="心律不齐，心律不齐的治疗方法有电击、心律调节器、药物治疗以及手术治疗。";
                    this.deptName='心血管内科';
                }else if(index==4){
                    this.mess="甲亢，如果未能及时干预，甚至会引起糖尿病酮症酸中毒和心衰。";
                    this.deptName='内分泌科';
                }		
			} 
            else if(i == 7) {
				//咯血	
                if(index==1){
                    this.mess="肺炎，症状轻者卧床休息，加强支持治疗，保证充分能量摄入；注意水、电解质平衡，维持内环境稳定；密切监测生命体征、指氧饱和度等。重症者需前往医院就诊";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="肺结核，需前往医院就诊，医生会根据您的年龄、整体健康状况、可能出现的抗药性和身体的感染部位来确定具体的用药和治疗时间。";
                    this.deptName='感染科、呼吸内科 ';
                }else if(index==3){
                    this.mess="肺真菌病，如果有咳嗽、咳痰、咯血等症状，可以去呼吸内科就诊。如果有发热、畏寒等症状，可以去发热门诊就诊。如果确诊是肺真菌病，需要去呼吸内科进行治疗。如果没有呼吸内科，可以去内科就诊。如果出现呼吸困难、大咯血等情况，需要立即到急诊科就诊，或拨打“120”呼叫救护车。";
                    this.deptName='呼吸内科、内科';
                }else if(index==4){
                    this.mess="支气管扩张,最佳就诊时间有低氧血症时";
                    this.deptName='呼吸内科';
                }else if(index==5){
                    this.mess="支气管扩张,如果咯血量比较少，请不要恐慌，尽量将血轻轻咳出，不要故意憋气，可以口服云南白药、安络血等药物进行止血治疗；当出现大咯血（一次咯血量超过200ml或24小时咯血量超过500ml）时应引起注意，积极预防咯血窒息，保证气道通畅。大量咯血时需禁食，小量咯血可进少量凉或者温的流质食物，饮食应忌辛辣刺激，同时保持大便通畅。大咯血无法控制下建议按照当地防疫要求，到附近医院急诊就诊，得到正规及时的诊疗。";
                    this.deptName='呼吸内科';
                }else if(index==6){
                    this.mess="心脏二尖瓣缺损，针对原发疾病治疗，给予抗感染、强心、利尿、扩血管、吸氧等对症处理。";
                    this.deptName='呼吸内科、心脏科';
                }		
			} 
            else if(i == 8) {
				//呼吸困难		
                if(index==1){
                    this.mess="哮喘，如果出现重度哮喘发作的症状（如因呼吸短促而讲话困难），请使用速效（急救）药物并立即前往诊所或寻求紧急治疗。建议您在发作后一到两天内继续使用速效药物，每 3 至 4 小时一次。您可能还需要在短期内服用口服皮质类固醇药物。";
                    this.deptName='肺科';
                }else if(index==2){
                    this.mess="慢性阻塞性肺病，以通过不吸烟，避免空气污染和接种疫苗来改善症状。可以通过药物、氧气和肺部康复进行治疗。";
                    this.deptName='肺科';
                }
			} 
            else if(i == 9) {
				//胸痛		
                if(index==1){
                    this.mess="冠心病心绞痛,常可由劳累、运动、饱餐、寒冷、情绪激动等诱发，休息或含服硝酸甘油可缓解。";
                    this.deptName='心血管内科';
                }
                else if(index==2){
                    this.mess="胸闷，建议做俯卧位通气。俯卧位通气指利用翻身床、翻身器或人工徒手操作，使患者在俯卧位进行通气，这个动作对肺部感染患者非常有益。";
                    this.deptName='呼吸内科、心血管内科';
                }else if(index==3){
                    this.mess="食管损伤,需及时前往医院处理，如果不及时处理可能会发生急性纵膈炎、食管胸膜瘘，甚至导致死亡。";
                    this.deptName='消化科';
                }else if(index==4){
                    this.mess="肺栓塞，治疗重点是防止血凝块增大并防止新的血凝块形成。及时治疗对预防严重并发症或死亡至关重要。治疗可能包括用药、外科手术和其他医疗程序以及持续护理";
                    this.deptName='心血管外科、肺科';
                }else if(index==5){
                    this.mess="胸部损伤,去医院进行胸片检查，除非其需要立即手术或立即胸部CT检查。轻微创伤且临床评估未显示任何损伤体征的患者，可能不需要行胸片检查；";
                    this.deptName='外科、内科';
                }else if(index==6){
                    this.mess="胃食管反流,建议您先尝试改变生活方式和使用非处方药。如果您的状况在数周内没有得到缓解，建议使用处方药并进行其他检查。";
                    this.deptName='消化科';
                }else if(index==7){
                    this.mess="纵膈性胸痛,感觉有明显胸痛不适，建议及时就诊";
                    this.deptName='胸外科';
                }	
			}
            }else{
                if(i == 0) {
				//咳痰
                if(index==1){
                    this.mess="支气管哮喘,应该积极地治疗，争取完全控制症状";
                    this.deptName='儿科、呼吸内科';
                }else if(index==2){
                    this.mess="肺结核，及时到当地结核病定点医疗机构就诊";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="慢性阻塞性肺病，可以通过不吸烟，避免空气污染和接种疫苗来改善症状。可以通过药物、氧气和肺部康复进行治疗";
                    this.deptName='呼吸内科';
                }	
			} 
            else if(i == 1) {
				//肩部疼痛
                if(index==1){
                    this.mess="心绞痛，需前往医院检查，医务人员会进行体格检查，并询问相关症状";
                    this.deptName='心血管内科';
                }else if(index==2){
                    this.mess="肩袖损伤,有肩部外伤史、50岁以上中老年人出现上述肩部症状时，应去医院就诊，排查是否肩袖损伤。轻度肩袖损伤可以采取保守治疗，让肩关节得到充分的休息，在医生指导下服用消炎、止痛药物，中医中药及功能康复锻炼，对肩袖损伤也有一定效果；严重肩袖损伤撕裂需要手术治疗。";
                    this.deptName='';
                }else if(index==3){
                    this.mess="肩袖损伤,有肩部外伤史、50岁以上中老年人出现上述肩部症状时，应去医院就诊，排查是否肩袖损伤。轻度肩袖损伤可以采取保守治疗，让肩关节得到充分的休息，在医生指导下服用消炎、止痛药物，中医中药及功能康复锻炼，对肩袖损伤也有一定效果；严重肩袖损伤撕裂需要手术治疗。";
                    this.deptName='骨科';
                }else if(index==4){
                    this.mess="肩周炎，以进行一些简单的治疗。比如，服用减轻疼痛和肿胀的药物，这些药物包括非甾体抗炎药，如布洛芬等；如果疼痛和肿胀很严重，可以通过肩关节注射皮质类固醇来减轻症状，短期的应用小剂量的激素不会造成不良反应；由康复师指导做拉伸和运动范围练习，可以去医院也可以在家进行这方面的锻炼。";
                    this.deptName='骨科';
                }else if(index==5){
                    this.mess="颈部疼痛，减少活动，卧床休息，也可佩戴颈托限制颈部活动。其次，使用非甾体类消炎镇痛药物以及肌肉松弛剂。同时，也可选择外用乳膏类药物、膏药、热敷等作为辅助治疗。";
                    this.deptName='骨科，神经科，复健科';
                }	
			} 
            else if(i == 2) {
				//喘鸣	
                if(index==1){
                    this.mess="哮喘，需及时去医院就医";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="支气管炎，患者常常需要补充液体和应用退热药物。可适当应用镇咳药物。痰量较多或较黏时，可应用祛痰剂。";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="呼吸困难，需前往医院就诊";
                    this.deptName='心脏科';
                }	
			} 
            else if(i == 3) {
				//咳嗽		
                if(index==1){
                    this.mess="过敏性咳嗽，去除病因，控制发作和预防复发，可通过寻找过敏源的方法找出过敏源而进行脱敏解决。此外受遗传和环境双重因素影响，应避免接触过敏原，积极避免清除感染病灶，去除各种诱发因素，如吸烟，油漆，冰冷饮料，气候突变等";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="药源性咳嗽,需前往医院检查";
                    this.deptName='呼吸内科';
                }else if(index==3){
                    this.mess="急性咽炎，可使用连花清瘟（颗粒或胶囊），以及一些辨证的汤剂，避免滥用抗生素。";
                    this.deptName='耳鼻喉科';
                }else if(index==4){
                    this.mess="咽炎，以缓解症状为主，如果有鼻咽部疾病的，要及时治疗疾病；病因不明确的，医生可能会推荐使用一些对症药物来缓解症状。此外，还有一些物理治疗，可能有一定效果。";
                    this.deptName='耳鼻咽喉科、呼吸内科';
                }else if(index==5){
                    this.mess="支气管炎，需要补充液体和应用退热药物。可适当应用镇咳药物。痰量较多或较黏时，可应用祛痰剂。";
                    this.deptName='呼吸内科';
                }else if(index==6){
                    this.mess="肺炎,应根据病菌种类及药敏结果选择用药。如有缺氧等症状给予吸氧和对症处理。防治并发症。加患者的护理工作，饮食宜清淡，易消化。";
                    this.deptName='呼吸内科';
                }
			} 
            else if(i == 4) {
				//心悸	
                if(index==1){
                    this.mess="心律不齐，适时向医生进行咨询";
                    this.deptName='心血管内科，心脏科';
                }else if(index==2){
                    this.mess="心力衰竭，需前往医院就诊";
                    this.deptName='心血管内科、内科';
                }else if(index==3){
                    this.mess="心律不齐，心律不齐的治疗方法有电击、心律调节器、药物治疗以及手术治疗。";
                    this.deptName='心血管内科';
                }else if(index==4){
                    this.mess="甲亢，如果未能及时干预，甚至会引起糖尿病酮症酸中毒和心衰。";
                    this.deptName='内分泌科';
                }		
			} 
            else if(i == 5) {
				//咯血	
                if(index==1){
                    this.mess="肺炎，症状轻者卧床休息，加强支持治疗，保证充分能量摄入；注意水、电解质平衡，维持内环境稳定；密切监测生命体征、指氧饱和度等。重症者需前往医院就诊";
                    this.deptName='呼吸内科';
                }else if(index==2){
                    this.mess="肺结核，需前往医院就诊，医生会根据您的年龄、整体健康状况、可能出现的抗药性和身体的感染部位来确定具体的用药和治疗时间。";
                    this.deptName='感染科、呼吸内科 ';
                }else if(index==3){
                    this.mess="肺真菌病，如果有咳嗽、咳痰、咯血等症状，可以去呼吸内科就诊。如果有发热、畏寒等症状，可以去发热门诊就诊。如果确诊是肺真菌病，需要去呼吸内科进行治疗。如果没有呼吸内科，可以去内科就诊。如果出现呼吸困难、大咯血等情况，需要立即到急诊科就诊，或拨打“120”呼叫救护车。";
                    this.deptName='呼吸内科、内科';
                }else if(index==4){
                    this.mess="支气管扩张,最佳就诊时间有低氧血症时";
                    this.deptName='呼吸内科';
                }else if(index==5){
                    this.mess="支气管扩张,如果咯血量比较少，请不要恐慌，尽量将血轻轻咳出，不要故意憋气，可以口服云南白药、安络血等药物进行止血治疗；当出现大咯血（一次咯血量超过200ml或24小时咯血量超过500ml）时应引起注意，积极预防咯血窒息，保证气道通畅。大量咯血时需禁食，小量咯血可进少量凉或者温的流质食物，饮食应忌辛辣刺激，同时保持大便通畅。大咯血无法控制下建议按照当地防疫要求，到附近医院急诊就诊，得到正规及时的诊疗。";
                    this.deptName='呼吸内科';
                }else if(index==6){
                    this.mess="心脏二尖瓣缺损，针对原发疾病治疗，给予抗感染、强心、利尿、扩血管、吸氧等对症处理。";
                    this.deptName='呼吸内科、心脏科';
                }		
			} 
            else if(i == 6) {
				//呼吸困难		
                if(index==1){
                    this.mess="哮喘，如果出现重度哮喘发作的症状（如因呼吸短促而讲话困难），请使用速效（急救）药物并立即前往诊所或寻求紧急治疗。建议您在发作后一到两天内继续使用速效药物，每 3 至 4 小时一次。您可能还需要在短期内服用口服皮质类固醇药物。";
                    this.deptName='肺科';
                }else if(index==2){
                    this.mess="慢性阻塞性肺病，以通过不吸烟，避免空气污染和接种疫苗来改善症状。可以通过药物、氧气和肺部康复进行治疗。";
                    this.deptName='肺科';
                }
			} 
            else if(i == 7) {
				//胸痛		
                if(index==1){
                    this.mess="冠心病心绞痛,常可由劳累、运动、饱餐、寒冷、情绪激动等诱发，休息或含服硝酸甘油可缓解。";
                    this.deptName='心血管内科';
                }else if(index==2){
                    this.mess="胸闷，建议做俯卧位通气。俯卧位通气指利用翻身床、翻身器或人工徒手操作，使患者在俯卧位进行通气，这个动作对肺部感染患者非常有益。";
                    this.deptName='呼吸内科、心血管内科';
                }else if(index==3){
                    this.mess="食管损伤,需及时前往医院处理，如果不及时处理可能会发生急性纵膈炎、食管胸膜瘘，甚至导致死亡。";
                    this.deptName='消化科';
                }else if(index==4){
                    this.mess="肺栓塞，治疗重点是防止血凝块增大并防止新的血凝块形成。及时治疗对预防严重并发症或死亡至关重要。治疗可能包括用药、外科手术和其他医疗程序以及持续护理";
                    this.deptName='心血管外科、肺科';
                }else if(index==5){
                    this.mess="胸部损伤,去医院进行胸片检查，除非其需要立即手术或立即胸部CT检查。轻微创伤且临床评估未显示任何损伤体征的患者，可能不需要行胸片检查；";
                    this.deptName='外科、内科';
                }else if(index==6){
                    this.mess="胃食管反流,建议您先尝试改变生活方式和使用非处方药。如果您的状况在数周内没有得到缓解，建议使用处方药并进行其他检查。";
                    this.deptName='消化科';
                }else if(index==7){
                    this.mess="纵膈性胸痛,感觉有明显胸痛不适，建议及时就诊";
                    this.deptName='胸外科';
                }	
			}
            }
		} 
        else if(y == 4) {
			//背部
			if(i == 0) {
				//腰痛
                if(index==1){
                    this.mess="腰椎间盘突出症，由于腰椎间盘突出通常会自行痊癒，因此应先尝试非手术治疗。假如症状没有改善，或在接受约 6 至 8 星期的非手术治疗后症状加重，则建议进行手术。";
                    this.deptName='骨科';
                }else if(index==2){
                    this.mess="肾小管细胞脱落，需及时前往医院就诊";
                    this.deptName='肾内科';
                }else if(index==3){
                    this.mess="肾结石，需去医院检查，应对症治疗。如绞痛发作时用止痛药物，若发现合并感染或梗阻，应根据具体情况先行控制感染，必要时行输尿管插管或肾盂造瘘，保证尿液引流通畅，以利控制感染，防止肾功能损害。";
                    this.deptName='泌尿外科';
                }
			}
		} 
        else if(y == 5) {
			//腹部
			if(i == 0) {
				//食欲异常
                if(index==1){
                    this.mess="糖尿病食欲亢进，改变生活方式，减少糖的摄入";
                    this.deptName='内分泌科';
                }else if(index==2){
                    this.mess="甲亢，可采用抗甲状腺药物、β 受体阻滞剂、放射性碘疗法、甲状腺切除术等方法治疗";
                    this.deptName='内分泌科';
                }else if(index==3){
                    this.mess="食欲减退";
                    this.deptName='内分泌科';
                }
			} else if(i == 1) {
				//打嗝
                if(index==1){
                    this.mess="在使用某些药物（如皮质类固醇、苯二氮卓类药物或某些治疗帕金森病的药物）、大环内酯类抗生素（红霉素、罗红霉素）或氟喹诺酮类抗生素（环丙沙星、环丙沙星、氧氟沙星、诺氟沙星）时会造成打嗝，应立即停止使用该药物";
                    this.deptName='消化科';
                }else if(index==2){
                    this.mess="植物神经功能紊乱,建议看中医，通过“调和气血以及脏腑功能入手，给以疏肝解郁、健脾养心、补肾健脑、益气养血、安神定志可奏效。”";
                    this.deptName='神经内科';
                }else if(index==3){
                    this.mess="吃喝太快、饮大量碳酸饮料会吸入过量的空气，这些空气通常到达不了胃，而是积聚在食管中，通过打嗝排除这些气体，可采用喝水弯腰法、屏息法、卷缩法、纸袋法。";
                    this.deptName='消化科';
                }else if(index==4){
                    this.mess="胃炎，进行科学且正规的治疗，并且形成健康规律的饮食、生活习惯。";
                    this.deptName='消化内科';
                }
			} else if(i == 2) {
				//腹痛	
                if(index==1){
                    this.mess="急性腹痛，有些腹痛如果诊断不及时或处理不当将产生严重后果，甚至可能危及患者生命，因此对突然发生的腹痛千万不要掉以轻心。有些腹痛，患者可以自己在家处理，有些腹痛必须尽快去医院诊疗，而有些腹痛则必须叫救护车，患者应在医生的监护下去医院。";
                    this.deptName='急性科';
                }else if(index==2){
                    this.mess="急性胰腺炎,需要及时前往医院进行相应的检查和治疗";
                    this.deptName='急诊科';
                }else if(index==3){
                    this.mess="阑尾炎，需立即前往就诊";
                    this.deptName='急诊外科、外科';
                }else if(index==4){
                    this.mess="胃溃疡，长期会饭后腹痛伴有其他胃肠症状要引起注意了，特别是对于40岁以上的中老年、有长期溃疡病史、近来疼痛节律性改变、食欲不振、体重短期内下降明显、有胃癌家族史的这些人群，更应该尽快到医院做胃肠镜检查。";
                    this.deptName='消化内科';
                }		
			} else if(i == 3) {
				//呕血与黑硬
                 if(index==1){
                    this.mess="溃疡穿孔或出血，建议立即就医，生可能会建议做内镜检查，以确定溃疡的位置和程度。治疗包括止血剂、贴敷技术、手术治疗等。此外，在治疗过程中应注意减少胃酸的刺激，避免食用刺激性食物、饮酒等。";
                    this.deptName='胃肠外科、消化内科';
                }else if(index==2){
                    this.mess="胃肠道出血，建议尽快就医，医生可能会进行内镜检查，以确定出血部位和病变情况。治疗包括止血、抗酸药物、修复黏膜、抗感染等。同时，应避免进食辛辣、酸性等刺激性食物，避免大量饮酒或吸烟等刺激胃肠道的行为。";
                    this.deptName='胃肠外科、消化内科';
                }else if(index==3){
                    this.mess="可能是肝硬化、肝癌等疾病，建议尽快就医，医生可能会进行内镜检查或其他影像学检查，以确定出血部位和病变情况。治疗包括止血、抗酸药物、抑制消化液分泌、较低病人的血压等措施。同时，需要治疗肝病本身，包括针对病因治疗、负荷减轻措施、肝脏支持治疗等。";
                    this.deptName='肝病专科、消化内科';
                }else if(index==4){
                    this.mess="大肠或小肠出血，需要调整饮食、禁止饮酒等生活方式，避免刺激性食物和药物的刺激。如果出血严重，可能需要住院治疗。";
                    this.deptName='消化内科、胃肠外科';
                }			
			} else if(i == 4) {
				//腹部肿胀	
                 if(index==1){
                    this.mess="可能由：肠蠕动障碍、肠梗阻、肠道疾病、肝脾肿大疾病引起,医生需要通过询问病史、体格检查、B超等检查来确定肿胀的原因。针对不同的病因，可以选择不同的治疗方法，如改善肠蠕动、调节饮食、药物治疗等。";
                    this.deptName='消化内科';
                }else if(index==2){
                    this.mess="可能由：肝硬化、肝炎、胆囊炎或胰腺炎疾病造成的，建议进行肝功能考查、B超、CT等检查来确定病因及严重程度，必要时进行肝穿刺活检。治疗取决于具体疾病的种类和严重程度，可以使用药物、手术、营养治疗等。同时，还需要注意避免烟酒等刺激性物质的刺激，控制饮食。";
                    this.deptName='消化内科';
                }else if(index==3){
                    this.mess="可能由：结肠癌、梗阻性肠炎疾病造成，医生需要通过询问病史、体格检查、B超或CT等检查来确定肠梗阻的原因和位置。治疗可能包括轻松排便、饮食和膳食纤维物质的调整、服用泻药、使用灌肠或手动清理大肠、手术治疗等。在治疗过程中，还应避免暴饮暴食或消化不良。";
                    this.deptName='消化科、胃肠外科';
                }else if(index==4){
                    this.mess="可能由：卵巢囊肿、子宫内膜异位症、消化系统疾病疾病造成，医生需要通过询问病史、体格检查、B超或其他影像学检查来确定疾病的原因。治疗可能包括针对疾病的药物治疗、外科手术治疗、调整饮食等等。如果情况比较严重，可能需要住院治疗。";
                    this.deptName='妇科、消化内科';
                }	
			} else if(i == 5) {
				//腹泻		
                 if(index==1){
                    this.mess="可能是由以下疾病引起的：肠易激综合症。克罗恩病。溃疡性结肠炎。肠道感染，如细菌性感染、病毒感染、真菌感染等。肠道菌群失衡。食物过敏。肠炎症，如阿米巴痢疾等。服用某些药物，如抗生素等，建议及时就诊，医生会根据病情和体征等进行一系列对症治疗，因为腹泻可以导致身体脱水，从而导致严重的后果。首先需要进行相关的检查，以明确患者的病情及原因。在治疗时应注意饮食调整、规律作息和心理调节等，同时也可以针对具体病情进行药物治疗。如果病情复杂，可能还需要与其他科室的医生联合诊治，当出现严重的腹泻或腹痛时要及时就医求助。";
                    this.deptName='消化内科';
                }else if(index==2){
                    this.mess="可能是由以下疾病引起的：细菌性肠道感染。病毒性肠道感染。食物中毒。肠结核。克罗恩病。溃疡性结肠炎。肠道恶性肿瘤。自身免疫性疾病。建议持续发热超过3天或症状加重，应及时到医院消化内科就诊，请尽量提供详细的病史、症状及体征，如腹泻情况、粪便性质、腹痛的部位、时间、性质等。医生根据患者的病情进行一系列的检查，并开具相应的药物治疗方案。在治疗时应适当调整饮食，注意卫生习惯，避免交叉感染，定期复诊，加强身体锻炼，保持良好的心态和睡眠习惯，让身体得到充分的休息以便更快地恢复健康。";
                    this.deptName='消化内科';
                }else if(index==3){
                    this.mess="可能由以下疾病引起的：肠道感染、消化系统疾病、肠道寄生虫感染，如果出现腹泻已经很久，并且大便呈油状并且有很臭的味道，建议及时就医消化内科，医生将根据患者的症状及体征等情况，进行相关的检查，如血常规、粪便常规、肠胃道内窥镜检查等，以明确病因，然后制定相关的治疗方案，需要根据病因进行有针对性的治疗。在治疗时应注意清淡饮食，禁忌辛辣刺激性食物，增加膳食纤维和蛋白质的摄入，加强休息，增强免疫力，尽量避免外出或接触病毒等病原体。定期复诊，并严格按医嘱进行治疗。";
                    this.deptName='消化内科';
                }else if(index==4){
                    this.mess="可能是肠道感染，食物中毒，药物国名，建议尽快就医，如果腹泻急性发作，可能引起脱水等后果，应到急诊科就诊，并告诉医生症状的具体表现、持续的时间、腹泻的次数及粪便的性质等，以便医生判断病情。如果是肠道感染，则需要使用相应的抗生素或抗病毒药物治疗，并补充口服补液盐水。如果是肠道炎症，需要用抗炎药或其他相应的治疗方法。需要在治疗期间注意饮食清淡，多喝水，调整好心态，以便更好的恢复健康。";
                    this.deptName='消化内科、急诊科';
                }
			} else if(i == 6) {
				//胃肠胀气
                 if(index==1){
                    this.mess="消化不良，建议减缓进食速度、避免大口吞咽食物，以及尽量减少饮用碳酸饮料等易产生气体的饮品。严重者建议进一步检查以确定症状的原因，并给予针对性的治疗和饮食建议。";
                    this.deptName='消化内科';
                }else if(index==2){
                    this.mess="胃肠道炎症，建议您尽快就医，医生将根据患者症状及体征等情况，排查胃肠系统相关疾病。如果是简单的消化不良，可以适当调整饮食，少吃油腻食物，饭后散步有助于促进胃肠蠕动，有助于消化。若确诊为消化系统疾病或其他慢性疾病需要针对病因进行治疗。";
                    this.deptName='消化内科';
                }else if(index==3){
                    this.mess="肠道菌群失衡，建议及时就诊，医生会根据病情和体征等进行一系列对症治疗。首先需要进行相关的检查，以明确患者的病情及原因。在治疗时应注意饮食调整、规律作息和心理调节等，同时也可以针对具体病情进行药物治疗。如果病情复杂，可能还需要与其他科室的医生联合诊治。如果出现严重的腹泻或腹痛，应考虑到是否需要紧急处理。";
                    this.deptName='消化内科';
                }else if(index==4){
                    this.mess="胃肠道疾病，建议您尽快前往医院消化内科就诊，医生会根据患者的具体症状和体征，结合医学检查结果，进一步确定疾病的类型、病情严重程度、是否需要紧急治疗等，然后开出相应的治疗方案。针对不同原因所引起的病情差异，我们建议在医生的建议下，适量调整饮食习惯、规律作息、合理使用药物治疗等方法。同时，需要注意饮食卫生，防止细菌感染等情况。";
                    this.deptName='消化内科';
                }			
			} else if(i == 7) {
				//反酸	
                 if(index==1){
                    this.mess="胃食管反流，需前往医院进行诊断，并给予相应的治疗方案，包括药物治疗和生活方式改变等。";
                    this.deptName='消化内科、胃肠外科';
                }else if(index==2){
                    this.mess="胃酸倒流（反酸），避免吃油腻、辛辣和奶制品催生的食物。限制饮酒，在喝酒时少量多次喝酒。不要使用香烟，尽量避免吸烟。少吃大食量，分几次进食，不要在睡前进食。避免紧身衣物，保持舒适。如果这些方法无法有效缓解症状，则建议咨询医疗保健专业人员以获取更多帮助。";
                    this.deptName='内科、消化内科';
                }else if(index==3){
                    this.mess="这些症状可能与胃炎、消化性溃疡、胆囊炎、胆石症等消化系统疾病有关，建议尽快就医。";
                    this.deptName='消化内科';
                }else if(index==4){
                    this.mess="胃食管反流病，需前往医院进行详细的问诊和身体检查，以确认您的病情并制定合理的治疗计划。";
                    this.deptName='消化内科';
                }
			} else if(i == 8) {
				//恶心呕吐
                 if(index==1){
                    this.mess="病毒引起的肠胃炎，可能会自行消退，严重中需要前往医院就诊";
                    this.deptName='儿科';
                }else if(index==2){
                    this.mess="胰腺炎，如果您感到胸痛压迫、闷痛，并且伴随着恶心呕吐的话，建议您立即就医。";
                    this.deptName='消化内科';
                }else if(index==3){
                    this.mess="急性胰腺炎,需要及时前往医院进行相应的检查和治疗";
                    this.deptName='急诊科';
                }
			}
		} 
        else if(y == 6) {
			//生殖器
			if(isSex==1){
                //男性
                if(i == 0) {
                    //早泄
                    if(index==1){
                        this.mess="男性性功能障碍的一种, 对于因心理原因引起的早泄和性交时的强烈焦虑情况，可能需要就诊精神科医生，推荐从专业的心理医生来寻求帮助和建议。心理医生会以心理治疗的方法帮助你解决焦虑情绪，并且对心理因素进行干预和调节，协助患者更好地应对性爱及期望等问题，改善性交时的心理压力和焦虑。";
                        this.deptName='男科、精神科';
                    }else if(index==2){
                        this.mess="常规的治疗方式包括口服药物、外用药、改善生活方式等。";
                        this.deptName='男科';
                    }else if(index==3){
                        this.mess="缓解担忧和焦虑情绪，减轻心理负担，注意生活习惯调整，如规律健康的饮食、适度的运动、保持良好的睡眠质量等等，有助于改善早泄的症状";
                        this.deptName='男科、心理科';
                    }else if(index==4){
                        this.mess="前列腺问题或其他泌尿生殖系统疾病，考虑采用口服药物、外用药，局部注射药物、手术等治疗方法，与此同时还需要注意养成健康的生活习惯，比如减少熬夜、饮食调节等，缓解症状。";
                        this.deptName='泌尿外科、男科';
                    }else if(index==5){
                        this.mess="个人卫生或清洗、局部护理或矫治手术等措施。对于早泄问题，根据个人情况和原因，也可能会开出相应的药物治疗方案或者其他建议，比如采取中药膏剂或其他口服药物、物理疗法等。";
                        this.deptName='男科、泌尿科';
                    }else if(index==6){
                        this.mess="可能是因为缺乏性经验，紧张和焦虑等心理因素的影响，控制情绪，放松身体，改变不良的性行为习惯等等。";
                        this.deptName='妇科(女性)、男科(男性)';
                    }
                } else if(i == 1) {
                    //阳痿
                    if(index==1){
                        this.mess="因为紧张、焦虑、缺乏自信等心理因素所致，控制情绪、放松身体、改变性行为习惯、提高自信等等。健康饮食、适量运动、避免压力、保持良好的心态和习惯等。";
                        this.deptName='男科';
                    }else if(index==2){
                        this.mess="因为药物所导致,停止对该药物的摄入，并前往医院就诊";
                        this.deptName='男科';
                    }else if(index==3){
                        this.mess="可能是由于心理因素、疾病等导致,如果是生理性原因引起的阳痿，则需要采用特定的药物治疗或其他治疗方法。同样需要注意生活习惯的调整，如减少熬夜、规律健康饮食、适量运动等等。";
                        this.deptName='男科';
                    }else if(index==4){
                        this.mess="严重的创伤造成,治疗的方法可能根据伤势的类型和程度不同而有所不同，有时可能需要进行手术治疗。此外，康复期的建议包括注意生活习惯的调整，如健康饮食、适度运动、避免吸烟饮酒等等。";
                        this.deptName='急诊科、泌尿外科';
                    }else if(index==5){
                        this.mess="可能是由于心理因素所致，注意生活习惯的改变，比如规律的饮食、充足的睡眠、适度的运动、避免熬夜等。通过提高身体素质、保持心态平衡，可以改善阳痿的症状并提高性生活质量。";
                        this.deptName='男科';
                    }else if(index==6){
                        this.mess="所致原因包括心理原因、荷尔蒙水平异常、健康状况等，持规律的健康饮食和适度的锻炼，以及改善生活和工作压力等方法也是有益的。加强自我保健，维护良好的心态和生活习惯，有助于改善阳痿的症状，提高性欲，享受健康的性生活。";
                        this.deptName='泌尿科、内分泌科';
                    }
                }
            }else{
                //女性
                if(i == 0) {
				 //月经过多
                 if(index==1){
                        this.mess="产后大出血，建议住院治疗，包括输液、输血、应用药物等。如果是妇科疾病引起的月经过多，比如子宫肌瘤、子宫内膜异位症等，建议进行手术治疗或者用药控制和减轻月经过多的症状。规律健康的饮食、适度的运动、保持良好的睡眠质量等等，有助于缓解月经过多的症状。";
                        this.deptName='妇科';
                    }else if(index==2){
                        this.mess="可能是由盆腔炎症、宫颈炎症、子宫内膜异位症等妇科疾病引起，需要注意生活习惯的调整，如规律健康的饮食、适度的运动、保持良好的睡眠质量等等，有助于缓解月经过多的症状。同时，需要避免性行为以避免感染加重，避免使用含有化学添加物的卫生巾和卫生棉条，保持局部清洁，并定期进行检查和妇科常规筛查。";
                        this.deptName='妇产科';
                    }else if(index==3){
                        this.mess="可能是由孕前期病变、宫颈炎症、宫腔内黏膜异位，宫内膜息肉、子宫内膜癌症等妇科疾病引起。如果是宫内膜异位、宫内膜息肉、宫颈炎症等妇科疾病引起，在确诊后可以通过手术治疗、用药治疗、物理治疗等方法进行治疗。如果怀孕了但出现了月经过多的症状，也要及时就诊，及时采取措施，保证母婴安全。";
                        this.deptName='妇产科';
                    }else if(index==4){
                        this.mess="可能是由荷尔蒙失调、卵巢功能异常、子宫肌瘤等妇科疾病引起，需要注意生活习惯的调整，如规律健康的饮食、适度的运动、保持良好的睡眠质量等等，有助于缓解月经过多的症状。";
                        this.deptName='妇科';
                    }
                } else if(i == 1) {
                  //白带异常
                  if(index==1){
                        this.mess="可能是由感染、阴道炎症、霉菌感染等因素引起，应该注意卫生习惯的调整，避免使用含有化学添加物的卫生巾，保持局部清洁并避免性生活。";
                        this.deptName='妇科';
                    }else if(index==2){
                        this.mess="可能由细菌感染、真菌感染、滴虫感染等疾病造成，服用抗过敏药物、使用卫生巾或棉布内裤等帮助缓解瘙痒等症状。注意个人卫生，注意清洗外阴部位；使用茶树油、黄连水等消毒液来清洗；保持干燥，采用透气性好的内裤等等措施";
                        this.deptName='妇科';
                    }else if(index==3){
                        this.mess="可能是由霉菌感染、细菌感染、宫颈糜烂、子宫内膜异位、阴道癌等多种因素引起，注意日常卫生习惯的调整，如保持外阴部清洁干燥、穿透气性好的内裤等，以避免感染加重。";
                        this.deptName='妇科';
                    }else if(index==4){
                        this.mess="可能是由宫内节育器刺激宫颈引起，如果白带异常确实是由于宫内节育器刺激宫颈引起的，建议患者更换其他避孕方式或者进行手术取出宫内节育器。如果不及时处理，白带出血可能会加重并引起其他妇科疾病。";
                        this.deptName='妇科';
                    }
                }else if(i==2){
                  //月经不调
                  if(index==1){
                        this.mess="可能是怀孕导致的月经不调，如果检查确诊怀孕，医生会给予相关的遵医嘱，如饮食、生活方式、保健等等。如果检查结果为非怀孕导致的月经不调，医生可能会通过中药、针灸、手术等方法进行治疗。";
                        this.deptName='妇科';
                    }else if(index==2){
                        this.mess="可能由内分泌失调、贫血、营养不良等造成,饮食调整、生活方式调整、药物治疗、控制精神压力等等。";
                        this.deptName='妇科';
                    }else if(index==3){
                        this.mess="可能是因为生殖系统未能正常发育,如果诊断为功能性子宫内膜发育不良，可能需要进行激素治疗或手术治疗来促进其发育。如果是其他原因，需要根据情况给予对症治疗。建议患者遵循健康的生活方式，包括规律、健康的饮食及适当的运动，控制压力，尽可能保证充足的睡眠等等。";
                        this.deptName='妇科';
                    }else if(index==4){
                        this.mess="相关的生活方式改变以及心理治疗，如减轻压力、保持良好的心态、规律的饮食和适量的运动等等，都可以有助于恢复正常月经。建议保持良好的生活习惯，定期观察自己的月经周期，如果长期存在问题或对月经周期不了解，可以请医生的帮助和指导。";
                        this.deptName='妇科';
                    }
                }else if(i==3){
                  //闭经
                  if(index==1){
                        this.mess="如果闭经是由结核病引起的，可以使用抗结核药物治疗。如果是其他原因引起的，可能需要根据病情给予对症治疗，如激素治疗等等。";
                        this.deptName='妇科';
                    }else if(index==2){
                        this.mess="如果闭经是由某些疾病引起的，需要针对性地进行治疗，如抗生素治疗、输液补液，促进胎儿发育等的治疗。建议平时要保持适当的运动和良好的生活习惯，饮食均衡以及避免紧张的心态。另外，应遵守医生的治疗建议，定期回诊检查。";
                        this.deptName='妇科';
                    }
                }else if(i==4){
                   //阴道出血
                   if(index==1){
                        this.mess="可能是因为外阴部位外伤所致，对于较严重的外阴血肿，可能需要进行手术排除血肿。对于轻度出血以及较轻微的外阴血肿，可能需要局部休息和冷敷，并要求避免性行为等激烈活动，以帮助身体自愈。建议遵照医生的治疗建议，定期进行检查，注意外阴部位卫生，避免再次受到伤害。";
                        this.deptName='妇科、外科';
                    }else if(index==2){
                        this.mess="出血的原因是胎儿流产、宫外孕等紧急病情，应立即给予适当的治疗措施，以保障孕妇和胎儿的生命安全。建议孕妇平时要保持适当的运动和良好的生活习惯，饮食均衡以及避免紧张的心态。出现阴道出血和腹痛等异常情况时，要及时就诊并接受医生的治疗建议。";
                        this.deptName='急诊科';
                    }else if(index==3){
                        this.mess="部分患者需要通过行内视镜治疗和到确诊病情；对患有恶性疾病或其他严重感染症状的患者通常需要行外科手术等治疗方法。建议保持规律生活，减轻压力，增强体质，注意护理月经中子宫颈和阴道部位卫生，及时就诊排除风险。";
                        this.deptName='妇科';
                    }else if(index==4){
                        this.mess="可能是避孕药物使用不当或其他原因造成，根据检查结果，医生会做出相应的治疗方案。对于由于避孕药物使用不当引起的阴道出血，可能需要更换避孕药物，调整剂量或服药时间等。若出血量较大，时间长且伴有外阴瘙痒、疼痛、局部肿胀等情况，建议尽快就医，以确保及时治疗并避免严重后果。";
                        this.deptName='妇科';
                    }
                }
            }
		} 
        else if(y == 7) {
			//上肢
			if(i == 0) {
				//手腕疼痛
                if(index==1){
                    this.mess="腕部疼痛，由突发损伤造成的扭伤或骨折引起，轻微扭伤和拉伤通常用冰、休息和非处方止痛药就可以治疗。但如果疼痛和肿胀持续超过几天或变得更严重，请就医。延误诊断和治疗会导致愈合不良、关节活动度缩小和长期失能。";
                    this.deptName='骨科';
                }else if(index==2){
                    this.mess="桡骨茎突狭窄性腱鞘炎,桡骨茎突狭窄性腱鞘炎的治疗旨在减轻炎症，保持拇指运动并防止复发。如果您提早开始治疗，则症状应在 4 到 6 周内有所改善。如果桡骨茎突狭窄性腱鞘炎始于怀孕期间，则症状可能会在孕期或哺乳期结束时消失。"
                    this.deptName='骨科'
                }
			}
		} 
        else if(y == 8) {
			//下肢
			if(i == 0) {
				//膝关节疼痛
                if(index==1){
                    this.mess="血友病/镰刀状细胞性贫血，血友病是一种遗传疾病，必须针对基因进行治疗，才有可能根治;镰刀状细胞性贫血目前仍无特殊有效疗法，以对症治疗和支持治疗为主"
                    this.deptName='血液科';
                }else if(index==2){
                    this.mess="急性半月板损伤,当合併有这些韧带伤时，患者膝关节疼痛会更剧烈、肿胀会更明显，关节不再稳定，不能屈伸，日常活动严重受限，必须就医治疗，若不治疗，任其发展，膝关节会像爆裂的汽车轮胎一样，不能再使用。";
                    this.deptName='骨科';
                }else if(index==3){
                    this.mess="膝关节扭伤,大多数轻度或中度损伤可以首先通过保护、休息、冰敷、压迫和抬高 (PRICE) 治疗，包括使用夹板或一种支撑膝关节防止膝关节弯曲的装置（膝关节固定器）来固定膝关节。提早开始活动范围锻炼";
                    this.deptName='骨科';
                }
			} else if(i == 1) {
				//踝部肿胀
                if(index==1){
                    this.mess="跌打损伤，:直接使用接骨散外敷，1-2天止痛消肿，2-3天治愈。三个月以内的新伤一般1-2副药就治愈了。";
                    this.deptName='骨科';
                }else if(index==2){
                    this.mess="关节炎，关节炎治疗的重点是缓解症状和改善关节功能。您可能需要尝试几种不同的治疗方法或者多种治疗方法的组合，才能确定最适合您的治疗方法。";
                    this.deptName='风湿科';
                }
			} else if(i == 2) {
				//髋关节疼痛
                if(index==1){
                    this.mess="股骨颈骨折,在做家务或者运动时不要让髋关节受到撞击或者是减少髋关节处的用力；其次，减少提重物等，而且在下雨、下雪天减少外出，防止摔倒；";
                    this.deptName='骨科';
                }else if(index==2){
                    this.mess="股骨大转子疼痛综合征,以保守治疗为主，在治疗之前应该先明确疼痛的原因，然后再对症治疗。";
                    this.deptName='骨科';
                }
			}
		} 
        else if(y == 9) {
			//四肢
			if(i == 0) {
				//红肿
                if(index==1){
                    this.mess="蚊子叮咬，涂抹洗剂、乳膏或糊剂；用冰块擦拭、按压；口服抗组胺药；如果蚊子叮咬后伴有严重状况的警告体征，请联系医务人员。这些症状可能包括高热、重度头痛、全身疼痛和感染体征。";
                    this.deptName='皮肤科';
                }else if(index==2){
                    this.mess="冻疮，可以用冻疮膏来缓解冻疮。如果冻伤的皮肤发痒，可以涂抹炉甘石洗剂来减轻，以免因抓挠而引起冻疮破溃感染。但若已经出现了感染，就必须要用抗生素了。";
                    this.deptName='皮肤科';
                }else if(index==3){
                    this.mess="烫伤，根据烫伤深度进行处理，一度烫伤应立即脱去衣袜后，将无破损创面放入冷水中浸洗半小时。二度烫伤，大水疱可用消毒针刺破水疱边缘放水，涂上烫伤膏后包扎，松紧要适度。三度烫伤，应用干净布包住创面及时送往医院。切不可在创面上涂紫药水或膏类药物，影响病情况观察与处理。";
                    this.deptName='皮肤科';
                }else if(index==3){
                    this.mess="外部损伤,常见的有按摩、冷敷等，当然根据不同的受伤部位，所使用的方法也是不同的。";
                    this.deptName='骨科';
                }
                
			} else if(i == 1) {
				//指甲问题
                if(index==1){
                    this.mess="银屑病，可使用乳霜和药膏（外用疗法）、光疗（光照治疗）和口服或注射药物。";
                    this.deptName='风湿免疫门诊、骨科';
                }else if(index==2){
                    this.mess="甲癣，目前所采用的主要药物和方式是手术拔除指甲、内服药物、外用药物和中医治疗灰指甲。口服药物主要包括特比萘芬、伊曲康唑和氟康唑。治愈后较易复发";
                    this.deptName='皮肤科、外科';
                }
			}
		}
        else if(y == 10) {
			//皮肤
			if(i == 0) {
				//红斑
                if(index==1){
                    this.mess="可能是冻伤或皮肤冷热刺激性过敏反应引起，避免暴露在低温下，保持身体温暖，避免刺激性物质接触皮肤，同时用温水洗涤受影响的皮肤区域并涂抹保湿霜来缓解症状。";
                    this.deptName='皮肤科';
                }else if(index==2){
                    this.mess="可能是感染性疾病引起的，建议及早就医";
                    this.deptName='感染科、内科';
                }
			} else if(i == 1) {
				//皮疹
                if(index==1){
                    this.mess="可能是感染性疾病或过敏反应等引起，建议及时带就医";
                    this.deptName='儿科';
                }else if(index==2){
                    this.mess="可能是由湿疹、银屑病、过敏性皮炎等原因造成，可以避免使用含有刺激性成分的洗面奶、化妆品等，避免暴晒，保持皮肤清洁、干燥，并避免除皮。";
                    this.deptName='皮肤科';
                }else if(index==3){
                    this.mess="可能是由过敏反应、感染性疾病、自身免疫性疾病等原因造成，口服或者外用的药物进行治疗，根据疾病性质和症状的严重程度而定";
                    this.deptName='皮肤科';
                }else if(index==4){
                    this.mess="可能是接触到某些刺激性物质、化妆品、药物等引起，保持皮肤干燥，清洁，需前往医院进行皮肤测试，进行相应的治疗";
                    this.deptName='皮肤科';
                }
			} else if(i == 2) {
				//脱发	
                if(index==1){
                    this.mess="可能是由遗传、营养不良、荷尔蒙失衡、压力、药物、疾病等原因造成，可以适量增加摄入蛋白质和维生素、减轻压力，避免染烫头发等有害行为。";
                    this.deptName='皮肤科';
                }else if(index==2){
                    this.mess="可能为白秃，治疗方法包括药物治疗和光疗等，但这些方法均需要在医生的指导下进行。";
                    this.deptName='儿科、皮肤科';
                }else if(index==3){
                    this.mess="可能是内分泌系统疾病造成，可选择药物治疗和手术治疗。同时，也可以通过改变饮食习惯和生活方式，如减轻压力、加强锻炼等方式来帮助减缓脱发的速度。";
                    this.deptName='内分泌科';
                }
			} else if(i == 3) {
				//皮肤瘙痒	
                if(index==1){
                    this.mess="可能有皮肤干燥、血液循环变差、药物过敏等原因引起，适当减少洗澡频率、使用温和的沐浴露和润肤品、保持室内湿度、避免紫外线辐射等方式来改善皮肤瘙痒症状。在就诊过程中，建议使用相关的抗过敏治疗和皮肤局部护理，如使用抗组胺药、激素类药物、润肤霜等。";
                    this.deptName='皮肤科';
                }else if(index==2){
                    this.mess="被蚊虫叮咬等原因引起，如果症状较轻，可以自行进行护理和缓解，如清洗受咬部位、使用止痒药物等。如果症状较严重或持续不退，需前往医院检查";
                    this.deptName='皮肤科';
                }
			} else if(i == 4) {
				//皮肤损伤
                if(index==1){
                    this.mess="需注意卫生清洁，避免创面感染和恶化，请勿自行进行诊断和治疗。";
                    this.deptName='皮肤科、外科';
                }else if(index==2){
                    this.mess="因皮肤摩擦或轻微的擦伤造成，可以使用局部抗生素、消炎药物以及保湿剂等，帮助伤口快速愈合。必要时，使用缝合材料进行缝合。在愈合过程中，应注意保持伤口干燥清洁，避免感染，避免破坏新生组织。虽然这种损伤情况下通常不会留下瘢迹，但如果伤口范围较大，可能会留下轻微的瘢痕。";
                    this.deptName='皮肤科、外科';
                }else if(index==3){
                    this.mess="可能是瘢痕的形成，也有可能是其他肿块，治疗方法将取决于肿块的性质和大小。如果是瘢痕，治疗方法可能先采用保守情况观察，避免蹂躏和碰撞等会影响愈合的创面。如果肿块较大或影响到日常生活，需要考虑手术切除。在治疗时，必须注意伤口局部卫生，保持清洁，避免感染。";
                    this.deptName='皮肤科、外科';
                }else if(index==4){
                    this.mess="在家时保持伤口干燥清洁，避免再次受伤（如穿舒适鞋、睡软垫等），并使用润肤霜辅助治疗。在治疗过程中，患者可采取保湿、润滑、避免过度清洁、预防感染等方面的措施。如果伤口非常严重，建议及时就医。";
                    this.deptName='皮肤科、外科';
                }
			} else if(i == 5) {
				//皮肤变色与色素痣
                if(index==1){
                    this.mess="色素沉着和晒斑，可以通过避免暴晒、防晒、使用美白化妆品、接受光子嫩肤（激光美白）等方式改善。但是如果病情比较重，需要考虑使用含有氢醌、曲酸等美白成分的药膏或口服美白药来进行治疗。";
                    this.deptName='皮肤科';
                }else if(index==2){
                    this.mess="雀斑、黄褐斑，建议停止使用避孕药，并进行治疗。如果怀孕，可能会选择使用安全的化妆品、药膏等进行治疗。在预防方面，建议在暴晒时穿戴遮阳服装和帽子、避免面部接触明亮的阳光、在避免使用含有刺激性成分的化妆品产品的同时，保持充足的睡眠、均衡的饮食和适当的水分摄入量。";
                    this.deptName='皮肤科、妇科';
                }
			} else if(i == 6) {
				//鳞屑
                if(index==1){
                    this.mess="皮肤病，治疗方法将取决于病因的诊断结果，可能包括口服药物、激光治疗、局部药物治疗等。在治疗过程中，患者应遵循医生的建议，进行适当的护理，保持皮肤的清洁和防晒，同时避免针对性刺激。对于可能的自身免疫疾病，医生会根据患者的情况进行评估并制定相应的治疗计划。同时，健康的饮食、运动和保持个人卫生习惯均有助于预防和缓解皮肤病。";
                    this.deptName='皮肤科、风湿免疫科';
                }else if(index==2){
                    this.mess="牛皮癣，治疗方法包括口服药物（如维甲酸）、局部药物治疗（如激素类和非激素类药物）、光疗等。在治疗过程中，应遵循医生的建议，进行适当的护理，如保持皮肤的清洁、润湿，保持个人卫生，并避免针对性刺激，避免穿紧身衣，避免过度劳累和压力过大等因素。";
                    this.deptName='皮肤科';
                }else if(index==3){
                    this.mess="银屑病，可以采用口服药物、外用药物、激光治疗等多种方法。在治疗期间，应该遵循医生的建议进行适当的护理，如保持皮肤的清洁、润湿，如有需要使用激素类或非激素类药物等。应注意避免穿紧身衣、压迫皮肤等，保持心情舒缓、正常的作息和饮食结构。";
                    this.deptName='皮肤科';
                }else if(index==4){
                    this.mess="牛皮癣，治疗方法包括口服药物、局部药物治疗和光疗等。在治疗过程中，应注意保持皮肤的清洁和润湿，避免针对性刺激和刮蹭牛皮癣疹，如有需要可以使用激素类和非激素类药物等。此外，患者应避免吸烟、酗酒和过度劳累等因素，保持心情愉悦，均衡饮食，增强体质。";
                    this.deptName='皮肤科';
                }
			} else if(i == 7) {
				//脓疱疹	
                if(index==1){
                    this.mess="新生儿脓疱疹，通常采用口服抗病毒药物和口服抗生素，以预防继发性感染。在治疗过程中，应注意保持婴儿的皮肤清洁、干燥，避免刺激，避免被感染的人接触婴儿，并确保其饮食充足、休息充足。";
                    this.deptName='儿科';
                }else if(index==2){
                    this.mess="疱疹性皮肤感染，使用口服药物、外用药物（如抗病毒药物、抗生素、抗菌药物、消炎药物等）、局部治疗（如激素类药膏、外用抗生素、伤口贴等）、保持局部清洁、干燥、避免刺激、科学饮食等。也应该注意个人卫生并采取一些预防措施，如避免不洁性行为、不与感染者共用个人物品、避免暴露于干燥、潮湿和寒冷环境等。";
                    this.deptName='皮肤科';
                }
			} else if(i == 8) {
				//皮肤溃疡
                if(index==1){
                    this.mess="糖尿病足溃疡，控制糖尿病、预防感染、保持伤口清洁、局部敷药、保持休息并适当升高伤肢等。在治疗过程中，注意控制血糖、坚持运动、保持适当的体重、坚持戒烟等，以预防糖尿病引起的并发症。";
                    this.deptName='内分泌科、血管外科';
                }else if(index==2){
                    this.mess="压疮，减轻疾病压力、保持伤口清洁、局部敷药，以及调整卧位、定时翻身、按摩等。在治疗过程中，注意保持营养、饮食均衡、适度运动以及避免过度疲劳";
                    this.deptName='皮肤科';
                }	
			} else if(i == 9) {
				//皮肤肿块
                if(index==1){
                    this.mess="皮下脂肪瘤，在确认肿块为皮下脂肪瘤后，大多数情况下不需要治疗，只需要进行定期随访即可。如果症状严重或忧虑，可能需要手术治疗。在治疗过程中，不应尝试自行抠挤肿块，以免引起感染并加重病情。";
                    this.deptName='皮肤科、外科';
                }else if(index==2){
                    this.mess="可能是药物或疫苗引起的副作用或过敏反应，治疗方法包括手术、放疗和化疗等。需要根据具体情况进行诊断和治疗，尽早及时就医以获得更好的治疗效果。";
                    this.deptName='皮肤科、外科';
                }else if(index==3){
                    this.mess="可能是面部黑色素瘤或良性色素痣，治疗方法主要包括手术切除、放疗、光治疗、化疗、靶向治疗等。在治疗过程中，需要注意保持伤口清洁、避免感染、避免阳光曝晒等。";
                    this.deptName='皮肤科、皮肤肿瘤科';
                }	
			}
		} 
        else if(y == 11) {
			//耳眼口鼻
			if(i == 0) {
				//口臭
                if(index==1){
                    this.mess='这可能是暂时性的口臭。在这种情况下，建议先进行口腔清洗和漱口，并保持充足的水分摄入，口臭会逐渐减轻或消失。保持良好的口腔卫生习惯并避免食用辛辣食物和饮酒等刺激性物质。';
                    this.deptName='口腔科';
                }else if(index==2){
                    this.mess='口腔疾病造成，做一些口腔护理，例如良好的口腔卫生习惯、日常口腔清洗、漱口等，同时也可以药物治疗，包括口腔消炎药、口腔保健产品等等。建议平时保持良好的饮食和饮水习惯，并积极开展口腔护理，使口腔保持清洁和健康。同时避免过度用酸性和辛辣饮食刺激口腔，尽量少吃高糖分食品';
                    this.deptName='口腔科';
                }else if(index==3){
                    this.mess='呼吸道感染，可口服或局部用药，例如抗生素、咳嗽药和局部止痛药，呼吸道感染如果不及时治疗，可能会引起严重的并发症，例如支气管炎、肺炎等，因此需要积极配合治疗，按时服用药物。同时，保持良好的生活习惯和饮食习惯，有助于预防感染扩散和口臭症状的恶化。';
                    this.deptName='耳鼻喉科';
                }else if(index==4){
                    this.mess='口干症，保持足够的水分摄入、使用口腔保湿剂、漱口，以及必要时补充营养物质等。也可使用一些药物来治疗口干症状，例如口腔刺激剂、唾液替代剂等。';
                    this.deptName='口腔科';
                }
			} else if(i == 1) {
				//嘴唇紫钳
                if(index==1){
                    this.mess='建议立即就医，因为嘴唇紫钳和呼吸困难可能是严重的疾病的症状，需要接受专业医生的诊治。';
                    this.deptName='急诊科、心血管内科';
                }else if(index==2){
                    this.mess='建议立即就医，因为嘴唇紫钳可能是与吸烟相关的肺或心脏疾病的症状，并需要接受专业医生的诊治。';
                    this.deptName='内科、呼吸科、心血管内科';
                }else if(index==3){
                    this.mess='建议立即就医，因为嘴唇紫钳和口腔内肿痛可能是严重的疾病的症状，需要接受专业医生的诊治。';
                    this.deptName='口腔科、耳鼻喉科';
                }
			} else if(i == 2) {
				//牙齿异常
                if(index==1){
                    this.mess='建议到医院就诊，接受口腔检查和拍X光片等检查来确定缺损的原因以及治疗方案。';
                    this.deptName='口腔科';
                }else if(index==2){
                    this.mess='建议立即就诊急诊，因为牙齿异常伴有下肢水肿、呼吸困难、心率加快或不齐，可能是严重心血管疾病的表现，需要立即就医。';
                    this.deptName='急诊科、心血管内科';
                }else if(index==3){
                    this.mess='建议立即就诊急诊，因为牙齿异常伴有手指紫甘、遇冷加剧、手心多汗、指尖发冷，可能是雷诺现象或其他类风湿性疾病的表现，需要立即就医。';
                    this.deptName='急诊科、风湿免疫科、神经内科';
                }else if(index==4){
                    this.mess='建议立即就诊急诊，因为牙齿异常伴有咳嗽、痰多、呼吸困难，可能是肺部疾病的表现，需要立即就医。';
                    this.deptName='急诊科、呼吸内科、口腔科';
                }
			} else if(i == 3) {
				//鼻塞流涕	
                if(index==1){
                    this.mess='症状较轻时可以在家休息并进行自我监测，如果症状严重或持续时间较长，建议就医。';
                    this.deptName='呼吸内科、感染科';
                }else if(index==2){
                    this.mess='建议立即就医，因为鼻塞并伴有颜色有黄变为暗棕或灰色可能是严重的感染或疾病的表现，特别是在婴幼儿时期服用四环素药物可能导致牙齿和骨骼畸形等问题，需要接受专业医生的诊治。';
                    this.deptName='儿科、呼吸内科';
                }else if(index==3){
                    this.mess='建议就医，因为鼻塞并伴有下颌出生时或出生后不久就有牙齿萌出可能是严重的疾病或先天性畸形的表现。';
                    this.deptName='儿科、口腔颌面外科';
                }else if(index==4){
                    this.mess='建议就医，因为鼻塞并伴有牙齿表面出现黄褐色斑块可能是严重的疾病或疾病的早期表现';
                    this.deptName='口腔科';
                }
			} else if(i == 4) {
				//眼睛红
                if(index==1){
                    this.mess='可能是结膜炎等病症引起，建议及时就医治疗';
                    this.deptName='眼科';
                }else if(index==2){
                    this.mess='建议就医，因为眼睛红、鼻腔干燥有脓痂、呼出气体有腥味可能是多种疾病的表现，需要接受专业医生的诊治。';
                    this.deptName='眼科、呼吸内科';
                }else if(index==3){
                    this.mess='建议就医，症状可能是过敏性鼻炎或者过敏性结膜炎引起的。若严重影响工作和正常生活能力，建议及时就医。';
                    this.deptName='眼科、耳鼻喉科';
                }else if(index==4){
                    this.mess='建议就医，因为眼睛红、间断性鼻塞可能是多种疾病的表现';
                    this.deptName='耳鼻喉科';
                }
			} else if(i == 5) {
				//眼睛干涩
                if(index==1){
                    this.mess='建议就医，因为长期使用某种眼药水可能会引起眼睛干涩的原因，在没有医生指导的情况下自行使用眼药水，久而久之可能会让症状加重或引起其他问题。';
                    this.deptName='眼科';
                }else if(index==2){
                    this.mess='建议及时就医，可能存在疾病需要治疗。可以进行眼部彩超、眼电图等检查确定诊断和治疗方案。在治疗过程中，可能需要关注眼睛的保湿，避免长时间使用电脑等。';
                    this.deptName='眼科';
                }else if(index==3){
                    this.mess='可能是角膜炎、青光眼等病症引起，需要及时就医治疗。';
                    this.deptName='眼科';
                }
			} else if(i == 6) {
				//牙痛
                if(index==1){
                    this.mess='建议尽快就医，因为发热、牙龈肿胀、颈部肿胀可能是牙髓炎、牙周炎等疾病引起的。';
                    this.deptName='口腔科';
                }else if(index==2){
                    this.mess='建议尽快就医，因为牙痛并带隐形眼镜可能会增加感染发生的风险。';
                    this.deptName='口腔科、眼科';
                }else if(index==3){
                    this.mess='对于怀孕期、哺乳期或口服避孕药的妇女来说，特别需要谨慎对待牙痛问题，建议及时就医。在治疗过程中，应特别考虑妇女身体习惯和特殊情况，避免使用可能对胎儿或婴儿构成危险的药物。建议注意口腔卫生，实行饮食禁忌并遵守医生给出的建议。';
                    this.deptName='口腔科';
                }else if(index==4){
                    this.mess='建议及时就医，因为这些症状可能与牙龈疾病或其他口腔问题有关，更年期和萎缩性舌炎等症状也需要考虑。';
                    this.deptName='口腔科';
                }
			} else if(i == 7) {
				//视力下降
                if(index==1){
                    this.mess='建议尽快就医，因为头部受过外伤后出现视力下降可能是颞骨骨折、脑震荡等严重损伤所致。';
                    this.deptName='眼科、神经外科';
                }else if(index==2){
                    this.mess='建议尽快就医，因为视力下降和牙齿敏感可能是视网膜病变、角膜炎、龋齿等疾病引起的。在治疗期间，要注意合理的口腔卫生，避免刺激性食物和饮料。';
                    this.deptName='眼科、口腔科';
                }else if(index==3){
                    this.mess='建议尽快就医，因为视力下降并伴有下颚疼痛和咯咯声可能是颞下颌关节症状所引起的。一些患者需要佩戴支架或保护器来缓解疼痛、恢复颞下颌关节。在治疗期间，建议注意口腔卫生，避免刺激性食物和饮料。';
                    this.deptName='口腔科';
                }else if(index==4){
                    this.mess='建议尽快就医，因为视力下降并伴随补过牙和疼痛可能是牙齿问题引起的。在治疗期间，建议注意口腔卫生，避免刺激性食物和饮料。';
                    this.deptName='口腔科';
                }	
			} else if(i == 8) {
				//眼球突出	
                if(index==1){
                    this.mess='建议尽快就医，进行眼科专业检查和诊断，以确认病情并获得合理的治疗方案。';
                    this.deptName='眼科';
                }else if(index==2){
                    this.mess='建议及时就医，进行眼科专业检查，以明确病情，并且排除严重的病理性问题。由于您的症状属于突发性，建议尽快去医院就诊，以防出现更严重的并发症。';
                    this.deptName='眼科';
                }else if(index==3){
                    this.mess='建议尽快去医院眼科就诊，进行眼部检查，以便诊断病因，开立针对性治疗方案。';
                    this.deptName='眼科';
                }
			} else if(i == 9) {
				//眼痛
                if(index==1){
                    this.mess='可能是眼内压增高引起的青光眼，或是其他眼部疾病的表现，建议尽快就医。要尽快进行眼科专业检查和诊断，以便确定病因和制定针对性的治疗方案。';
                    this.deptName='眼科';
                }else if(index==2){
                    this.mess='可能是病毒性或细菌性脑膜炎引起的眶周炎或眼病，或者是其他疾病引起的症状，建议立即前往医院就诊并进行全面的检查。';
                    this.deptName='眼科';
                }else if(index==3){
                    this.mess='可能是眼部感染的表现，需要及时就医。建议到医院眼科就诊，医生可能会进行细致的眼部检查和近距离观察，以确定眼部感染的类型和严重程度。';
                    this.deptName='眼科';
                }
			} else if(i == 10) {
				//白瞳症
                if(index==1){
                    this.mess='以上情况需要及时到医院找专业医生进行检查和治疗。白瞳症可能是白内障一种形式，需要及时诊断和治疗。早产儿由于身体发育未成熟，可能更容易受到化学物质和其他物质的伤害，因此建议及早就医。';
                    this.deptName='儿科、眼科';
                }else if(index==2){
                    this.mess='以上症状可能是精神情绪问题引起的，建议到医院找专业心理医生进行心理治疗和见识激素等药物治疗。对于白瞳症，建议到医院眼科就诊，进行眼部检查和治疗。';
                    this.deptName='眼科、心理科';
                }else if(index==3){
                    this.mess='建议尽快到医院眼科就诊，进行眼部检查和诊断。如果需要手术治疗，可以找到专业的眼科手术医生进行手术治疗。';
                    this.deptName='眼科';
                }
			} else if(i == 11) {
				//嘴疼
                if(index==1){
                    this.mess='可能是口唇疱疹引起的，建议尽快去医院就诊，进行口腔科专业检查和诊断。在明确病因的情况下，可针对性制定合理的治疗方案，避免症状加重。';
                    this.deptName='口腔科';
                }else if(index==2){
                    this.mess='这种情况需要尽快到医院就诊。因为眼内流脓性分泌物可能是眼睛感染的症状，需要进行相应的检查和治疗。对于新生儿而言，情况比较特殊，需要预防儿童常见疾病，以保障幼儿的生长发育和健康。';
                    this.deptName='儿科、眼科';
                }else if(index==3){
                    this.mess='可能是眼球内部的病理性问题，建议尽快去医院就诊，进行眼科专业检查和诊断。在诊断病因的情况下，可以针对性地制定治疗方案，以保护眼睛和保护和改善视力。';
                    this.deptName='眼科';
                }else if(index==4){
                    this.mess='可能是先天性白内障引起的，需要早期诊断和治疗。建议尽快到医院眼科就诊，进行眼部检查和诊断。如果诊断为白内障，需要在医生的指导下进行治疗，包括手术治疗等方式。';
                    this.deptName='眼科';
                }
			} else if(i == 12) {
				//听力下降
                if(index==1){
                    this.mess='以上症状可能涉及到耳朵内部的问题，建议尽快到医院就诊。';
                    this.deptName='耳鼻喉科';
                }else if(index==2){
                    this.mess='可能是过敏反应引起的，建议停止使用化妆品，并及时到医院就诊。';
                    this.deptName='皮肤科';
                }else if(index==3){
                    this.mess='可能是口腔黏膜疾病引起的，建议尽快到医院进行耳鼻喉科和口腔科专业检查。医生会细致地检查并评估症状，根据具体情况制定相应的治疗方案。';
                    this.deptName='耳鼻喉科、口腔科';
                }else if(index==4){
                    this.mess='可能是口腔念珠菌感染引起的，需要及时就医。建议将儿童带到医院就诊，进行口腔科专业检查和诊断，以便明确病因。如果确诊为念珠菌感染，医生将对症治疗。同时，对于听力下降的情况，还需要到耳鼻喉科进行检查和治疗。';
                    this.deptName='口腔科、耳鼻喉科';
                }
			} else if(i == 13) {
				//耳鸣
                if(index==1){
                    this.mess='需要前往医院进行听力测试等相关检查以确定耳鸣的原因，并且可以根据具体情况制定相应的治疗方案。';
                    this.deptName='耳鼻喉科';
                }else if(index==2){
                    this.mess='可能原因是先天性耳聋，医生会给您推荐合适的助听器、人工耳蜗等治疗方法。另外，如果发现听力异常是由于其他健康问题引起的，例如耳感染、中耳积液等等，医生为可能会开出针对性的药物治疗方案，可以减轻症状并改善听力。';
                    this.deptName='耳鼻喉科';
                }else if(index==3){
                    this.mess='可能是噪音性聋或耳硬化症等问题，建议尽快前往医院就诊。医生可能会对您进行听力测试和相关检查，如Tympanometry、BERA和MRI等，以确定减退的原因和耳鸣的具体情况，并推荐相应的治疗方法。';
                    this.deptName='耳鼻喉科';
                }else if(index==4){
                    this.mess='建议前往医院就诊。医生可能会对您的耳朵进行检查、听力测试和CT检查等来了解您的耳朵受伤的程度以及可能引起耳鸣的原因。根据具体情况，医生可能会推荐药物治疗、手术或其他治疗方法。';
                    this.deptName='耳鼻喉科、急诊科';
                }
			} else if(i == 14) {
				//眼屎多
                if(index==1){
                    this.mess='这些症状可能与面神经瘫痪或颅神经损伤有关，治疗的方法将取决于疾病的严重性和类型，可能包括药物治疗、康复治疗和手术治疗等多种方法。及早就诊，病情恢复的机会就更高。';
                    this.deptName='神经内科';
                }else if(index==2){
                    this.mess='这些症状可能与脑外伤、颅内出血、内耳障碍等神经系统疾病有关，建议尽早就诊，并且严格按照医生的指导进行治疗，以避免症状变得更加严重。如果确诊为内耳障碍，则可能需要进行一些耳蜗植入手术或听觉减弱治疗或其他耳蜗植入装置等治疗方法。';
                    this.deptName='神经内科、耳鼻喉科';
                }else if(index==3){
                    this.mess='可能是内耳障碍、中耳炎、迷路炎、良性位置性眩晕以及其他问题的表现，您可以先保持休息，避免突然站起或改变体位，以减轻眩晕和其他不适症状。';
                    this.deptName='急诊科';
                }else if(index==4){
                    this.mess='这些症状可能是脑卒中、颅内出血、脑肿瘤等情况的表现，应立即就医。';
                    this.deptName='神经内科、急诊科室';
                }
			} else if(i == 15) {
				//流泪
                if(index==1){
                    this.mess='应前往医院进行检查,在进行检查之前，您应该保持眼睛清洁，避免揉搓眼睛，并暂时停止使用化妆品、护肤品等物品。根据具体情况，医生可能给予口服或眼用药物，或者进行手术治疗，以缓解症状并治疗疾病。';
                    this.deptName='眼科';
                }else if(index==2){
                    this.mess='可能需要进行手术治疗、药物治疗和物理治疗等措施。在就诊之前，您可以暂时冷敷并保持眼部清洁卫生。';
                    this.deptName='眼科、皮肤科';
                }else if(index==3){
                    this.mess='可能是眼结膜炎、麦粒肿、串珠性角膜炎、角膜炎等一系列眼部疾病造成，建议前往医院就诊';
                    this.deptName='眼科';
                }
			} else if(i == 16) {
				//流鼻血
                if(index==1){
                    this.mess='可以尝试坐在直立的位置，并轻轻垂直头部，用手捏住鼻孔两侧压迫鼻部，至少十分钟，可以止血或减轻鼻出血，如果鼻出血缓慢、血量小，可以根据医生建议采用药物止血和局部冰敷等治疗方法。如果情况比较严重和复杂，医生可能需要进行一些手术治疗来止血和治疗引起外伤的病因。';
                    this.deptName='急诊科、耳鼻喉科';
                }else if(index==2){
                    this.mess='这些症状可能是角膜炎、结膜炎、角膜溃疡、异物刺伤等眼部疾病的表现。在就诊前，您可以先用清水冲洗眼睛，避免揉搓以防加重症状。 医生可能会对您的眼睛进行详细检查和测试，以确 定疾病的种类和严重程度，然后推荐适当的治疗方法，如药物治疗、手术治疗或其他治疗措施。保证眼睛清洁卫生，远离刺激性物质，定期复查是预防眼睛疾病的有效方法。';
                    this.deptName='眼科';
                }else if(index==3){
                    this.mess='这些症状可能是结膜炎、眼睑炎、干眼症等眼部疾病的表现，建议您改变生活和用眼习惯，如避免长时间用眼，防止眼部刺激等，同时配合给予药物治疗，如浸润治疗或口服药物以缓解症状。只有在医师的指导下，才可以使用眼药水或眼膏进行治疗，以保证治疗效果和安全。';
                    this.deptName='眼科';
                }
			}
		} 
        else if(y == 12) {
			//其他
			if(i == 0) {
				//多汗症
                if(index==1){
                    this.mess='治疗方法可能包括药物治疗、胸腺切除、切除汗腺等，以减轻多汗症症状和预防相关并发症。如果需要，医生可能还会给患者提供营养、运动和健康生活方式的建议，以帮助患者达到理想体重和保持健康。';
                    this.deptName='内分泌科、皮肤科';
                }else if(index==2){
                    this.mess='治疗可能包括抗生素、镇痛药、退烧药等药物治疗。此外，医生还可能会根据病情给予营养和辅助治疗，以加速痊愈。';
                    this.deptName='感染科';
                }
			} else if(i == 1) {
				//黄疸
                if(index==1){
                    this.mess='治疗方法可能涉及光疗、药物治疗、输液等，以确保减轻黄疸，并避免黄疸对婴儿的神经系统产生影响。对于消瘦的患儿，医生需要检查患儿的喂养方式和体重变化情况，了解患儿的生长发育情况。根据患儿的情况，医生会制定相应的喂养计划和营养咨询来促进患儿的生长发育。';
                    this.deptName='儿科';
                }else if(index==2){
                    this.mess='这些症状可能涉及胆管或胰腺疾病，治疗方法可能包括药物治疗、手术、胆道引流等方法，以根据病因治疗黄疸，缓解上腹痛、呕吐等症状。在治疗期间，医生可能还会给患者升温、止痛、止吐等辅助治疗，以减轻其他症状。';
                    this.deptName='消化内科';
                }
			} else if(i == 2) {
				//水肿
                if(index==1){
                    this.mess='在确认诊断后，医生也会根据患者的病情，给予适当的药物和治疗建议，如利尿剂、口服的肾保护药、调整饮食等。';
                    this.deptName='肾内科、泌尿外科';
                }else if(index==2){
                    this.mess='在诊断后，医生会制定相应的治疗计划，包括药物治疗、营养调节和生活方式改变等治疗方案来治疗水肿和其他症状';
                    this.deptName='神经内科、肾内科';
                }else if(index==3){
                    this.mess='这些症状可能是妊娠期高血压综合征或子痫前症的表现，治疗方法可能涉及到控制血压的药物、控制蛋白尿和预防孕产妇和胎儿的并发症。如果病情严重，可能需要进行紧急分娩或剖宫产，以确保母婴的安全。因此，如果出现这些症状，建议尽快就医进行治疗。';
                    this.deptName='妇产科';
                }
			} else if(i == 3) {
				//疲劳	
                if(index==1){
                    this.mess='改变饮食习惯、适度运动、控制体重、增加睡眠时间等。有时候，可以进行适当的药物治疗。';
                    this.deptName='内分泌科、心血管内科';
                }else if(index==2){
                    this.mess='建议适当调整工作和休息的时间、增加适量的运动、改善饮食和睡眠等，来改善身体状况和预防疲劳症状';
                    this.deptName='内科';
                }else if(index==3){
                    this.mess='这些症状可能是糖尿病的征象，医生会针对患者的症状进行治疗和建议，如药物治疗、饮食调整、运动改善等，并进行长期随访和控制，以防止糖尿病及其相关并发症的发生。';
                    this.deptName='内分泌科';
                }
			} else if(i == 4) {
				//血压高
                if(index==1){
                    this.mess='您的症状可能涉及到高原反应引起的血压升高，建议多喝水、适度休息、补充维生素等。如果病情严重，医生还可能会考虑将患者转移到低海拔地区进行治疗。';
                    this.deptName='心血管内科';
                }else if(index==2){
                    this.mess='建议改变饮食习惯、适度运动、控制体重等生活方式，以帮助降低血压和改善身体健康';
                    this.deptName='内分泌科';
                }
			} else if(i == 5) {
				//周身疼痛
                if(index==1){
                    this.mess='可能是风湿热引起的综合症状，建议尽快到医院就诊';
                    this.deptName='内科、心血管内科';
                }else if(index==2){
                    this.mess='慢性疼痛症，慢性疼痛不是单一疾病，其诊断和治疗具有一定的复杂性，可能需要长时间的治疗过程，需要对治疗方案和方法耐心细致地配合，并适当调整自己的生活方式，以缓解疼痛症状和提高生活质量。';
                    this.deptName='风湿免疫科、神经科';
                }else if(index==3){
                    this.mess='骨质疏松，养成良好的生活习惯，例如适当的饮食、健康的生活方式和足够的锻炼以及室内保持良好的通风状态等，以促进康复或延缓疾病的发展进程。';
                    this.deptName='内分泌科、骨科';
                }else if(index==4){
                    this.mess='强直性脊柱炎，尽量减少肥胖、坚持适当的运动和按摩等方式来缓解强直性脊柱炎的症状和加快康复。';
                    this.deptName='风湿免疫科';
                }
			} else if(i == 6) {
				//低血压
                if(index==1){
                    this.mess='医生会根据病史和症状综合判断是否需要调整降压药物剂量或更换药物。同时需要进行相关检查，如血压监测、心电图、超声心动图等，以确定病因和治疗方案。';
                    this.deptName='心血管内科、内分泌科';
                }else if(index==2){
                    this.mess='可能需要进行24小时动态血压监测和倾斜试验等相关检查，以帮助确定诊断和治疗方案。建议注意保持充足的水分摄入、饮食均衡、适当增加运动量，通过改变生活方式和饮食习惯来提高血压。';
                    this.deptName='内科、心血管科';
                }else if(index==3){
                    this.mess='需要医生快速进行评估和处理，以避免出现危险情况。在急诊科医生会对患者进行必要的检查，如血压监测、心电图、血液储备量、血糖水平等，以确定病因和进行迅速处理，如提高血容量、给予输液等。同时，医生还可能会建议患者去神经内科、心血管内科等科室进行详细检查，并定制个体化治疗方案。';
                    this.deptName='急诊科';
                }
			} else if(i == 7) {
				//出血倾向
                if(index==1){
                    this.mess='这些症状可能是严重的血液疾病如血癌、血小板减少性紫癜等所引起的，治疗可能包括输血、免疫疗法、化疗等治疗措施。在治疗期间，患者需要遵守医生的建议并密切关注身体的变化。';
                    this.deptName='急诊科、血液科';
                }else if(index==2){
                    this.mess='可能会产生出血倾向的药物包括抗凝药物、抗血小板药物、非甾体类抗炎药等。医生将根据患者的情况进行评估，确定药物是否可继续使用，调整用药方案或者停药。需要注意平时饮食的清淡，饮食维生素E、维生素K等营养物质来增强血液凝固功能。';
                    this.deptName='内科';
                }
			} else if(i == 8) {
				//感觉不适
                if(index==1){
                    this.mess='这些因素可能与心脑血管疾病、消化系统疾病、肝脏疾病等相关，适当改变生活方式，戒烟、戒酒、少喝咖啡等，减轻因为吸烟、饮酒等原因引起的症状。';
                    this.deptName='内科';
                }else if(index==2){
                    this.mess='需要密切关注身体的变化，按医生要求服药、忌酒、忌烟、注意饮食和休息，以加快恢复。';
                    this.deptName='急诊科';
                }
			} else if(i == 9) {
				//消瘦
                if(index==1){
                    this.mess='可能与营养不良、消化系统疾病、代谢异常、肿瘤等因素有关，可能需要进行一系列的检查，如血常规、生化指标、影像学检查等，以便确定疾病的类型和程度。';
                    this.deptName='内科';
                }else if(index==2){
                    this.mess='可能是营养不良、肠道吸收不良、消化系统疾病等多种疾病的表现，家长需要重视婴儿的饮食和生活习惯，适当地增加婴儿的营养摄入和运动量，以保持婴儿的身体健康。';
                    this.deptName='儿科';
                }else if(index==3){
                    this.mess='可能是某些精神因素、内分泌异常或其他身体疾病导致的，治疗可能包括口服药物、心理治疗和营养支持等。同时需要引导患者保持积极乐观的生活态度，加强运动和饮食调节，以维持健康的体重和状态。';
                    this.deptName='神经科、内分泌科';
                }else if(index==4){
                    this.mess='这些症状可能是胰腺、肝脏和胆道、肠道等器官的疾病所导致的，如胆囊炎、胰腺炎、脂肪吸收不良综合征等，需要注意饮食卫生，避免食用过多高脂肪、高糖的食物，注意防止胃肠感染等疾病的发生。';
                    this.deptName='消化内科';
                }
			} else if(i == 10) {
				//肥胖
                if(index==1){
                    this.mess='需要进行相关的检查，包括体重、身高、体脂率、血脂、血糖等，评估肥胖的程度和发生糖尿病、心血管疾病等相关风险的情况，给出相应的治疗和管理方案。';
                    this.deptName='内分泌科';
                }else if(index==2){
                    this.mess='根据药物的类型和服用情况，医生可以评估药物对肥胖的治疗效果以及对身体其他方面的影响，结合身体状况给出相应的治疗和管理方案。同时，还需要进行相应的检查，包括体重、身高、体脂率、血压、血糖等，综合评估肥胖的程度和患者身体的健康状况。';
                    this.deptName='内分泌科';
                }else if(index==3){
                    this.mess='需要注意季节变化的影响，制定适合节气的饮食和运动方案，以持久有效控制体重。';
                    this.deptName='内分泌科';
                }else if(index==4){
                    this.mess='调整心理状态对于肥胖的治疗也十分重要。医生可以为患者制定全面的治疗方案，包括药物治疗，心理治疗或行为治疗等，以帮助患者控制体重和调节精神状态。';
                    this.deptName='神经科';
                }
			} else if(i == 11) {
				//震颤和抽搐
                if(index==1){
                    this.mess='可以选择先观察2-3天，如果仍然出现这种症状，建议去医院，接受相关检查和诊断，确定病因和采取相应的治疗方案。';
                    this.deptName='神经内科';
                }else if(index==2){
                    this.mess='需要向医生说明具体的药物类型，用药时间和剂量等信息，以便医生作出更为准确的诊断和治疗计划。';
                    this.deptName='神经内科';
                }else if(index==3){
                    this.mess='如果症状严重影响到生活和工作，建议在就诊同时进行全面体检和相关检查，确定是否有其他疾病所导致的症状，如脑卒中、头部外伤等，以获得更为全面的诊断和治疗。';
                    this.deptName='神经内科';
                }
			} else if(i == 12) {
				//婴儿夜惊
                if(index==1){
                    this.mess='夜惊是一种神经系统发生紊乱的情况，通常在儿童和青少年时期出现。建议避免过度的刺激和环境的改变，保持充足的睡眠，避免用药，避免激发夜惊。患有夜惊症的儿童通常是由于神经系统的发育异常、身体疲惫、情感紧张、不合适的睡眠环境、药物不当使用等引起的。在调节孩子睡眠环境方面，应在孩子睡觉时让房间尽量舒适安静，避免白天让孩子过度刺激、激动和受到恐惧的影响。对于孩子夜惊症的家庭，家长需要尝试采取适当的行为技巧和管理技巧来帮助孩子安然入眠和防止夜惊的发生。如果夜惊情况比较严重，建议及时就医，进行药物治疗，针对性的使用安眠药、镇静剂或其他控制夜惊发作的药物进行治疗，同时严格遵循医嘱，有效预防夜惊的发生。';
                    this.deptName='儿科、神经内科';
                }else if(index==2){
                    this.mess='在家庭中，还应保持室内空气流通，温度适宜，共同维护婴儿的健康和舒适感。家长在孩子夜惊和发热时，应及时就医儿科或儿童急诊，接受医生的评估和治疗，同时注意控制室温，提高室内空气流通，并给予婴儿足够的抚慰和关注。';
                    this.deptName='儿科、急诊';
                }else if(index==3){
                    this.mess='建议避免过度的刺激和环境的改变，保持充足的睡眠，避免激发夜惊。夜惊可以用觉醒式训练进行治疗，让孩子改变夜惊的反应。家长应该留意孩子的睡眠状态，避免孩子过度疲劳，不要把被子盖得太厚，避免孩子寝室内光线过亮、有噪音和温度过高，应营造安静、柔和、有利于休息的睡眠环境，以有助于孩子养成健康的睡眠习惯。如果情况比较严重，家长可以让孩子戴上夜间卫生帽，避免孩子把毯子踢掉影响睡眠。';
                    this.deptName='儿科、神经内科';
                }else if(index==4){
                    this.mess='观察孩子的液惊频率和发作时的情况，如发作的时间、时间长度、出现什么症状等。给孩子提供安静、舒适、宁静的睡眠环境，确保孩子能够充分睡眠。避免让孩子疲劳过度，平时注意调节孩子的情绪、避免刺激，培养孩子良好的生活习惯。';
                    this.deptName='儿科、神经内科';
                }
			} else if(i == 13) {
				//失眠
                if(index==1){
                    this.mess='改变生活习惯、进行心理治疗、服药等。建议尽量避免在晚餐吃得过饱或饮酒，以免影响睡眠。要保持规律的睡眠习惯，养成良好的睡眠习惯，并且避免夜间过度刺激（如光线、响声、工作等）。保持一个健康的生活方式和心态可以帮助患者缓解症状，促进睡眠和恢复。';
                    this.deptName='神经内科';
                }else if(index==2){
                    this.mess='胡乱服用刺激性饮料或食物，可能会导致失眠发生，干扰睡眠周期和睡眠质量。改变生活习惯、进行心理治疗、加强锻炼、戒掉刺激性食品和饮料等。同时，避免在晚间过度饮用含有咖啡因、可乐或茶等刺激性饮料，尽可能在晚餐后避免饮用这些饮料。要保持规律的睡眠习惯，避免日夜颠倒，并避免在床上效力和其他活动。保持一个健康的生活方式和心态，有助于促进睡眠和恢复。';
                    this.deptName='神经内科';
                }else if(index==3){
                    this.mess='了解药物对身体的影响，避免滥用或误用药物，以免产生副作用或其他不良反应。要保持规律的睡眠习惯，规律生活、健康饮食和锻炼有助于恢复良好的体质和心态，促进睡眠和恢复。';
                    this.deptName='神经内科';
                }else if(index==4){
                    this.mess='适应新的时间区域差、改变生活习惯、减低压力、加强锻炼等。同时，避免在晚间大量饮食、饮酒或其他刺激性饮料等，调整好睡觉的环境，保持规律的睡眠习惯，避免日夜颠倒，尽可能让身体适应新的休息和时间环境。保持一个健康的生活方式和心态，积极面对生活的改变和挑战对于失眠的治疗和恢复非常重要。';
                    this.deptName='神经内科';
                }
			} else if(i == 14) {
				//思维和感觉混乱
                if(index==1){
                    this.mess='建议及时进行身体检查，排除药物对身体造成的损害，并明确药物对神经系统的影响程度。同时，应该寻求专业的心理治疗，以应对可能因药物引起的精神疾病或心理障碍。治疗期间要严格按照医生的处方进行治疗，保持乐观的心态，配合医生进行治疗。在平时要注意避免娱乐性药物或其他可能有害物质的接触，保持健康的生活方式和积极心态，预防思维和感觉混乱的发生。';
                    this.deptName='神经内科';
                }else if(index==2){
                    this.mess='改善睡眠周期、改变生活方式、药物治疗等。同时，需要加强对自己的健康管理，了解如何控制压力、保持良好的睡眠习惯、饮食习惯等。保持心态乐观，积极面对有关的问题，可以帮助身体和大脑快速恢复。';
                    this.deptName='神经内科';
                }else if(index==3){
                    this.mess='这种情况可能与精神或心理因素有关，如焦虑症、抑郁症、创伤后应激障碍等，以及如脑震荡、意外事故等引起的神经系统疾病等。需要保持积极乐观的心态和生活方式，避免触动过敏的情况，尽量保持正常的生活和工作节奏，控制自己的压力和情绪。如果需要，可以在专业医生的指导下进行适度的锻炼和参加适当的活动来促进身体的健康和恢复。';
                    this.deptName='精神科';
                }
			} else if(i == 15) {
				//不育
                if(index==1){
                    this.mess='建议进行有关的性病检查，例如性病抗体检查等，了解有无患有性病病毒。此外，针对不孕不育的问题，建议进行生殖系统检查，如精液检查、卵巢功能检查、输卵管造影等检查，以确定生殖系统的功能状态，并确定病因。在确定了病因之后，建议接受相关的专业治疗，如激素治疗、微创手术等手段进行治疗。治疗期间还应注意生活习惯，保持良好的作息习惯、饮食习惯等，同时恢复身体健康状态和身体免疫能力。';
                    this.deptName='男性泌尿科、女性妇产科';
                }else if(index==2){
                    this.mess='建议进行睾丸检查，如睾丸彩色多普勒超声、精液分析等检查，了解睾丸的病变情况。睾丸疼痛、肿胀、大小异常等症状可以是睾丸炎、附睾炎、睾丸扭转等多种生殖系统疾病的表现，应特别注意。在明确病因后，可以针对具体病因进行治疗，如激素治疗、微创手术等手段。治疗期间应积极控制情绪，避免性生活，同时注意个人卫生，加强锻炼、保持规律的生活作息，以及饮食调节等，帮助恢复身体健康。';
                    this.deptName='泌尿科';
                }
			} else if(i == 16) {
				//焦虑
                if(index==1){
                    this.mess='可通过药物治疗来缓解焦虑症状。建议平时也要注意生活细节，如规律作息、适当锻炼、健康饮食等，尽量减少压力，并掌握缓解焦虑的有效方法。';
                    this.deptName='神经内科';
                }else if(index==2){
                    this.mess='戒烟或停止服用安眠药会引起身体与心理的反应，建议咨询专业的心理医生，采用认知行为疗法、放松训练等专业技术，提供合适的心理治疗方案。如果需要，医生也可以适当开具药物治疗，例如抗焦虑药物等，但需要权衡利弊和注意用药安全。在治疗期间，建议积极调整生活习惯，加强锻炼、保持规律的生活作息，以及保持健康的饮食习惯。';
                    this.deptName='神经内科';
                }else if(index==3){
                    this.mess='体重减轻、眼球突出等症状可能与甲状腺功能亢进或其他神经内科相关疾病有关建议进行甲状腺功能检查、眼科检查、神经内科检查， 初步确定病因。在确定了原因后，针对焦虑症状可以采用心理治疗、药物治疗等综合手段进行治疗。此外如果是内分泌疾病导致的症状，应该接受专业的内分泌科的治疗。';
                    this.deptName='内分泌科、神经内科';
                }
			} else if(i == 17) {
				//神经衰弱
                if(index==1){
                    this.mess='可以采取药物治疗和康复治疗，帮助恢复神经功能。同时，注意生活细节，如规律作息、积极锻炼、饮食调节等。视病情需要，还可以进行心理咨询和心理疏导。';
                    this.deptName='神经科';
                }else if(index==2){
                    this.mess='建议进行全面体检，检查神经系统、内分泌系统功能，以及营养状况是否充足。同时，注意改善生活习惯，加强锻炼，保证充足的睡眠和饮食均衡。';
                    this.deptName='神经科、内分泌科';
                }else if(index==3){
                    this.mess='减轻工作负担、调整作息，尝试放松训练等。同时，可以接受心理咨询和疏导，帮助缓解焦虑和压力，提高身心健康水平。';
                    this.deptName='神经科';
                }
			} else if(i == 18) {
				//抑郁
                if(index==1){
                    this.mess='将药物治疗、心理治疗、社交治疗、光照疗法等结合进行，根据具体情况制定治疗计划。治疗过程中，患者也需要积极配合，遵从医嘱，并保持积极的治疗态度和健康的生活方式。如果出现抑郁症状，不要犯难或抵触就医，应积极寻求专业帮助。同时，在工作、家庭等方面，也应寻求适当的支持和帮助，避免因应付生活带来的精神压力，导致抑郁症状加重。';
                    this.deptName='精神科';
                }else if(index==2){
                    this.mess='在抑郁症状出现的情况下，建议寻求专业帮助，获取更好的治疗和支持，同时也可以采取一些自我调节和放松的措施，如运动、读书、听音乐等。同时，注意保持良好的生活习惯，均衡饮食、规律作息、适量运动、控制压力等都有助于舒缓抑郁症状。需要注意的是，抑郁症是一种常见的心理疾病，应重视治疗，并且不可自我诊断和草率用药，应咨询专业的医生或心理医生，并积极配合治疗。';
                    this.deptName='精神科';
                }
			} else if(i == 19) {
				//发热
                if(index==1){
                    this.mess='一些药物会引起不同程度的发热，而且不同人对药物的反应也不同，因此在使用药物期间，应密切关注自己的身体状况，如出现相关症状，应尽快就医。';
                    this.deptName='内科、感染科';
                }else if(index==2){
                    this.mess='可能是流感或其他呼吸系统感染的表现，建议采取一些措施来防止病情恶化，如保持室内空气流通、勤洗手、避免接触已经感染的人员、以及多喝水、休息等。需要注意的是，发热、打喷嚏、流涕等症状可能是某些传染病的症状，需及时就医寻求治疗。在出现这些症状时，需要遵循防控措施，如戴口罩、保持社交距离等，避免传染给他人。';
                    this.deptName='呼吸内科、传染病科';
                }
			} else if(i == 20) {
				//晕厥
                if(index==1){
                    this.mess='可能有心血管疾病、低血糖、内耳感染、神经系统疾病等造成，建议保持平静心态，避免突然起身或倒腾身体，保持正确的姿势，保证足够的休息和睡眠。同时，如果晕厥发作时受伤或有其他症状出现，应及时医治。';
                    this.deptName='急诊科';
                }else if(index==2){
                    this.mess='可能是由于运动引起的心脏问题，如心肌梗死、心律失常等，建议保持平静心态，保持正确姿势，能够呼吸顺畅。如果晕厥发生时，立即停止运动，保持平静，扶着墙或门框，以免跌倒造成伤害。';
                    this.deptName='急诊科';
                }
			}
		}
    },
    methods:{
        order:function(){
            this.$router.push({name:'Notice'})
        }
    }
}
</script>
<style lang="less" scoped>
@import "./css/mui.min.css";
</style>